[
    {
        "id": 3,
        "first_name": "Michael",
        "last_name": "Beeson",
        "similar_professors": [
            "Wendy Lee",
            "Ashish Khanchandani",
            ""
        ],
        "ratings": [
            "Well... the subject of differentials & linear algebra is hard. That said, he does try to make it as easy as possible by using variation of example problems on the midterms. Sample midterm/ final was just like the real exam. Study, Study, Study. Got by this class by self-learning everything from khan academy and youtube. Textbook is useless",
            "Math 123 can be one of the hardest courses for engineering students at SJSU. Therefore, I believe that Prof. Beeson has done the best he could. I don't know why people keep complaining about partial credit, but I agree with his point of view - If you want to become an engineer, you are not allowed to make mistakes. That's life, deal with it.",
            "Prof. Beeson is extremely apathetic to students, he does not care if you pass or fail. On exams, he does not give any partial credit, which is extremely odd for a math class. Even if you did the problem correct but made a mistake, you lose all your points for one question because Mr. Beeson expects you to be perfect. Strongly do not recommend him",
            "I sleep in class and I still manage to average a B grade for the 3 midterms.",
            "He's so boring and even makes me feel sleepy. I always plays computer games during classes and have to learn the knowledge by myself",
            "2 midterms, 1 final. 10 questions total, and doesn't give partial credit or any extra credit. His voice is very monotone, making it difficult to pay attention. What's worse is trying to understand his handwriting. Half the time, I couldn't read what he wrote because it was so tiny and pretty much chicken scratch. Try to avoid taking him.",
            "Decent professor, knows his material really well but isnt effective in teaching it to other... tests and exams arent too bad they are similar to the sample exams he gives... similar concepts just different problems... quizzes time to time... be prepared to learn the majority of the lectures on your own...",
            "DO NOT take this professor, terrible at speaking and explaining. Tests are only a few questions and a lot of points. Gave one section an easier final than the other, and does not give partial credit.",
            "I took calculus before so the class wasn't as hard however, his tests are only 10 problems usually and each is worth a ton and he doesn't give partial credit usually so you have to exact. No calculators for his class and random quizzes in class from time to time. Hw is easy all done on an online program no effort, will you learn calculus, maybe.",
            "This proffesor is a total joke, avoid him at all costs. He manages to take a not too challenging subject into something impossible."
        ]
    },
    {
        "id": 15,
        "first_name": "Richard",
        "last_name": "Kubelka",
        "similar_professors": [
            "Alana Bailey",
            "Amanda Frank-Baldwin",
            ""
        ],
        "ratings": [
            "I'm a math major and my GPA was solid 3.5+. but after taking one class with him.. ughhhh no. just no. please no. my first time failing class in my whole life.",
            "Had a horrible time in this class and Im good at math. He discourages using calculators or formulas, is terrible at lecturing, and doesnt put any grades in Canvas.",
            "He's horrible, take him at your own risk. I'm taking him online and have been struggling in his class. He refuses to record online lectures. He barely grades any assignments throughout the whole semester until the end. His exams are nothing like the homework and gives no study guides or practice test questions. He uses proctorio for tests.",
            "Don't take him for any math classes unless you are a math genius. His midterms and final were ridiculously harder than the homework, and he never went over the concepts behind the exam problems before the exams. He doesn't even curve the exams even if they are below the class average. The majority failed in his classes. Avoid him at all costs!",
            "He's a pretty good professor as long as you go to class. Most of the problems on exams will be the ones he does in class, so go to class. He will often say if he asks this on exams this is how to do it and then he'll show the work. Three exams total, two midterms and a final. The homework isn't too helpful so don't expect those on exams.",
            "Overall, a manageable class with a relatively difficult subject matter. Most of the tests are questions and examples he mentions in class so it is important that you attend and pay attention to all of his lectures. Homework seemed like busy work since the problems were way harder than ones in class and were not on the tests at all.",
            "Look for practice midterms for his class. They are pretty similar to his real exams. Also, even though he primarily presents through PPT, really understand the definitions and underlying proofs/probs he writes. If you don't understand them, either ask people around you or a tutor after class. Understanding each definition and proof is key for exam!",
            "If you have the opportunity to take discrete math with another instructor or to a community college, do so. His teaching style is heavy on his slides which relates NOTHING to the homework. His homework DOES NOT reflect what he teaches in class. I ended up learning discrete math from a YouTuber. This was a waste of time and money.",
            "Barely any curve, just recites text directly from textbook, and does NOT put any grades online through the grading portal or use it at all for that matter.",
            "His lectures are based off of slides, which aren't the best to learn from due to them being blobs of text. He goes way too fast as well, sometimes skipping topics or barely explaining them. Homework doesn't seem to help much on exams. Does give sample of old exam for the first exam, though."
        ]
    },
    {
        "id": 18,
        "first_name": "Ty",
        "last_name": "Lin",
        "similar_professors": [
            "Wendy Lee",
            "Ashish Khanchandani",
            ""
        ],
        "ratings": [
            "Ty Lin seems like a great guy. Love his classes, always looking forward to them , because he is so nice and motivating.",
            "I've never been more confused in all my school years. He is very disorganized. Teaches a topic at the end that is not available online, in textbooks or even through adequate in-class materials. I've never seen the whole class so confused and disappointed in a teacher. You've been warned.",
            "Not a good choice. Difficult to understand his english. Random lecture topics. Seemed unorganised and chaotic. However you dont have much of a choice with his subject.",
            "Database is an important class, so please don't waste yours on him.",
            "Adamant, vague, confusing. In the two lectures I stayed for, Lin was very insistent that we all have Visual Studio (even if it meant installing another OS). He threatened to drop anyone who couldn't get it, despite there being more viable alternatives to VS. The advice he gives is questionable; he told me the C# template I had was fine (it wasn't).",
            "Horrible teacher. Barely lectures during class time, and continually talks about his project his students have contributed to over the years. It's nearly impossible to understand what he is saying; he doesn't clarify details at all. Gives sporadic quizzes 5 minutes after an unclear lecture. Probably the worst class I've taken in my life. AVOID HIM.",
            "It is really easy class. If you get lower than B+, then you might need to switch Major. Class topic can be helpful for your study but lecture is NOT useful",
            "Absolutely and unequivocally the worst teacher I have ever had in my entire life. You will learn very little to nothing from him and what he expects on assignments and tests is unclear. His communication skills, both written and verbal, are almost nonexistent. The class was a very long and stressful way to learn a little SQL from a textbook.",
            "Worst professor on earth. Harasses mentally. NOT fair with grading. Calls on weekends, holidays. His moto is to torture students",
            "Terrible teacher. Lectures are slow and repetitive. Course breadth is extremely narrow. He does not speak good English. He cannot see well enough to read read and makes constant typos. Homework assignments are poorly given without full explanation of grading criteria. He gives free grades increases and extra credit for helping him outside of class."
        ]
    },
    {
        "id": 29,
        "first_name": "Scott B.",
        "last_name": "Key",
        "similar_professors": [
            "Matthew Leonard",
            "Sam Welbaum",
            ""
        ],
        "ratings": [
            "love this guy",
            "Great person, but not the best teacher. He puts lots of emphasis on critical topics for the exams which was helpful, but does not stay on topic during lectures all the time and relies too much on group projects for homework.",
            "Great Professor! Would take him again. He is super caring and has a loving and warm attitude, which makes class easy to go to. Take him if you can. Class is paper heavy there are no tests. Gives good instruction on papers though.",
            "Professor Key is awesome! For this introductory honors seminar, he does an amazing job with class discussions and making the lectures student lead instead of professor led. He gives great feedback on papers, so if papers are not your thing he will help you write them well. He is very good at making time outside of class for students.",
            "Get ready for tons of lectures and notes. As long as you pay attention you'll pass. Has extra credit assignments here and there, but he's very passionate about the subject and expects you to discuss the topics.",
            "Great guy, but the class was a bit of a headache. He lectured a lot, and ended up basically yelling trying to be 'passionate.' there is lots of group work, and the tests are very difficult to prepare for. I would love to speak to him outside of class, but I just didn't enjoy how he taught.",
            "I'd 10/10 be friends with him outside of class but do not take his class. Way too difficult for the level of the class and his tests do not reflect your understanding of the content 0/10.",
            "I'll preface this by saying I'm a lazy student who doesn't like applying myself. This class requires you to do the reading and really think in order to excel. That being said, I loved the class so much, I changed my major. Dr. Key is the best college professor I've ever had. If you have a chance to learn from him, do it. Right now.",
            "This is the hardest class i have ever taken. A lot of work and reading to prepare for tests. The tests are long and you only have the class time to finish.",
            "If there is another professor for this course take him (or her). He only explains subjects in ways that he can understand but leaves the rest of the class confused. He answers questions harshly and is not the friendliest guy. He weights his tests a lot so if you do poorly on one test it will really affect your grade. Tests are extremely difficult."
        ]
    },
    {
        "id": 45,
        "first_name": "Jamie",
        "last_name": "Lash",
        "similar_professors": [
            "Karen Martin",
            "Alexander Al Spencer",
            ""
        ],
        "ratings": [
            "You have to take him if you have the CLS scholarship. Show up for class and do the homework; study for the exams (you can find help online). Don't let it bring your other studies down.",
            "Professor Lash is a terrible teacher, he talks about random things that do not relate to Christian leadership. Tests are difficult, all answer choices seem correct, and again do not relate to the topic of the class. I did not learn much in this class. Do not recommend.",
            "Learned more about Christ through Forest Gump than from this guy!",
            "Be aware, he isn't the most accommodating professor in the world. So students with disabilities will have to problem solve outside of him. Even though his theology can be a little wack, you can still learn some things from his lessons. Just let God guide you through the class and it will be ok.",
            "It's a 0 credit class and it has about as much work as my 4 credit hour classes. You have to take it if you have the scholarship, just be prepared. Exams have content from anything to facts about cows and gorillas to Bible memory verses.",
            "I think everyone is being dramatic. He is kinda creepy and his analogies can be super weird, but that's life. It's a lot of work for a 0 credit hr class that is doable if you manage your time.I can see where he's coming from usually... his delivery on concepts can just be off-putting. I wouldn't take him again but it wasn't the end of the world.",
            "If you can get ahead on all of your homework, you will be fine. Yes, there are assignments due before every class but they're like 5-10 question assignments based on super short chapters in his book. It's tedious and annoying, but the class is required. You'll be okay if you are organized and can stay ahead.",
            "Absolutely horrible",
            "He makes a zero credit course more work than all the other classes you have combined. He makes the students study and read out of a book that he wrote.",
            "He is a better professor than others would indicate. He cares about students and wants to make a positive impact in their lives. I only have two issues: there is too much homework and studying for a 0-credit class and the concepts may (only sometimes) be a bit simplistic and specific only to certain situations. Overall, he is a good professor."
        ]
    },
    {
        "id": 47,
        "first_name": "John",
        "last_name": "Swain",
        "similar_professors": [
            "Sergey Kravchenko",
            "Jonathan Blazek",
            ""
        ],
        "ratings": [
            "AMAZING",
            "Good guy, makes lectures interesting but they can get confusing so you need to pay attention. Tests come straight off the homework, as long as you take a look at the assignments before the test you'll have no problem. Highly recommend.",
            "John Swain gets it. He presents physics in a fun, upbeat way that makes non-physics college students enjoy it. He's a character and he's lectures are entertaining. If you try a little bit you'll get an A. I appreciate physics more bc he didn't shove it down my throat, he made it fun.",
            "Really great instructor. If you study from the problem sets and take good notes you are sure to pass.",
            "Great Professor: kind, understanding, need to know the basics but no trick questions. Makes the material easy to understand. Very fair and promotes real life work like collaboration",
            "My favorite professor I've had so far! He had such enthusiasm and made a lot of things that could have been boring very interesting. He could be a bit confusing at times, but always went back to go over things we weren't clear on. His exams were very fair and easy as long as you study from the problem sets he provided. Awesome guy, learned a lot.",
            "Professor Swain is the best teacher I've had at Northeastern. Ridiculously knowledgeable, hilarious, and very helpful. Lectures go off on tangents but they are always interesting, and if you don't understand something in the lecture he will gladly meet you anytime to help you. Loves the subject and genuinely wants his students to learn and do well.",
            "A really fantastic person who wants his students to not only do well but also enjoy the subject matter. caution: he mixes a very divergent mindset with occasional convergence to the main ideas and some analysis. If you haven't learned where to pay attention and take notes, you will only be catching about half of the information presented in class.",
            "fun guy, class easy to get through, very smart but terrible class if you want to learn physics-had to have someone else teach me the material-he says dont worry about your grade he'll curve but his curve brought my grade down so be careful",
            "Very entertaining professor. He tells great stories and keeps you awake in class for the most part. Unfortunately, his teaching method is not all that effective and the tests can be hard if you didnt understand the material. Gives very generous curves tho."
        ]
    },
    {
        "id": 48,
        "first_name": "Nancy",
        "last_name": "Signorielli",
        "similar_professors": [
            "Christian Reilly",
            "Dannagal Young",
            ""
        ],
        "ratings": [
            "Very rude and was always annoying. Would give a harsh grade no matter how little a mistake was even if it was a simple punctuation error they would take off a shit ton of points do not reccomend.",
            "She is nice at giving feedback but there's a plethora of papers and homework passed around every day.",
            "Not the biggest fan. Hard to do well and shes very rude. Would not recccomend.",
            "She was so bad, I wanted to give her a zero. But that's not possible. So, I give her a 1.",
            "Class was extremely boring and she gets specific on her tests when there is a lot of information. I took it over winter session and found it harder than what people led it on to be.",
            "If you do any mass comm research, you'll find her name everywhere. She knows her stuff and is so nice and helpful. her media message analysis class is easy and interesting. another cool comm professor",
            "Nancy is the most lovable and kindhearted professor in the Comm department!",
            "take research with her winter session if you need it for Comm. total easy A",
            "I don't understand why she has such bad ratings. I just finished taking research methods with her over winter sesh and easily got an A. the tests are crystal clear and follow the notes/book exactly. I recommend taking research methods over winter session with her for any CommI major. Shes also a nice person and willing to answer any questions",
            "I took her online class COMM251 \"communicating effectively\"... easiest online class I've ever taken! it only took me one day to go through the online required readings/assignments; if you have any questions/concerns she gets back to you through email very fast; best class possible for 1-credit elective"
        ]
    },
    {
        "id": 57,
        "first_name": "Joan",
        "last_name": "Frederick",
        "similar_professors": [
            "Katey Castellano",
            "Allison Fagan",
            ""
        ],
        "ratings": [
            "she is a definition that cares a lot about students",
            "She is so sweet. Take her.13 maybe 14 quizzes and she drops the lowest 3 or 4.Two test and a final.3 papers. Just read the required readings and and you will get an A.",
            "Dr. Frederick's class reminded me of pleasant story times when I was younger. Be prepared to read and to be quizzed on your readings. (Spark notes helped me when I was feeling lazy). The books chosen were great and the essay topics were worth writing on. I highly recommend her class to any English majors.",
            "She's a sweetheart and knows her stuff. But be ready to READ! Her 3 exams aren't too bad, just do the reading.",
            "If it goes on the board it goes on the test. Expect to do a lot of reading. You have to work in this class, but she is very sweet and can be forgiving if you do. If you don't do the reading her tests/quizzes will consume your soul. She is old fashioned, but that's not surprising considering she may have dated Thoreau in high school. I loved her.",
            "Absolute sweetheart! She really loves/cares about her students, and knows why literature is important. Two 10 page papers, a midterm, and a final. Good reading, she connects it with your life and past historical events. GREAT ENGLISH TEACHER, and GREAT PROFESSOR OVERALL. I LOVE HER!",
            "Good prof, a lot of reading that can it very tedidious, but that's a english class for you...she makes it fun though, and really tries to give you a good grade fairly...i love her to death, somedays the class gets on my nerves, but then again, we all have those days",
            "SO MUCH READING. The text book has Bible-thin pages, so reading takes forever. Don't read in bed; you'll fall asleep. Gives hints about when you'll have a quiz. 3 tests not cummulative. over 10 quizes, but she only keeps your top 10 grades. 3 papers. Boring material, but she knows her stuff. She's a good teacher; the material is just boring.",
            "I've taken classes with Prof. Frederick twice already and would definitely take a class with her again. She is very knowledgeable and is very passionate about what she teaches. I don't know if I would have enjoyed Moby Dick as much without her enthusiasm and passion. She is helpful, sweet, and funny. A great teacher and a nice person.",
            "I love her. She is always willing to help and can be very witty and clever in class. She is my favorite professor because of her kindness and caring nature. There were two 10 page papers, two tests, and about 15 reading quizzes for the semester. Ask her for help on the papers and just do your reading for the tests/quizzes -you'll be fine!"
        ]
    },
    {
        "id": 58,
        "first_name": "Bruce",
        "last_name": "Johnson",
        "similar_professors": [
            "Katey Castellano",
            "Allison Fagan",
            ""
        ],
        "ratings": [
            "Dr Johnson is amazing. I know way more about CS Lewis than I ever wanted but he made the class as easy as possible. Reading quiz every class but they're easy questions and you grade it yourself; at the very least sparknote it and you'll do okay. Gives random points out, but 2 big papers he grades pretty tough on. Weird but easy and enjoyable GenEd",
            "Johnson is the sweetest! He really cares about his students, whether that means success in his class or outside it. Some people in my class complained that they couldn't follow what he was saying, but they can't expect to vibe well with every professor they meet. Johnson really does his best to make grammar as easy to digest as possible! Take him!!",
            "a great professor who genuinely cares about his students and trusts them. he is a personable guy and respects everyone's opinions. attendance isn't taken but there are quizzes each class. even though I was allowed two skips I didn't take any because I actually wanted to be in class.",
            "I really liked Dr. Johnson! He chooses interesting pieces for reading material, and you have discussions in class. There were 3 papers and a midterm and final, and quizzes almost every class. It may sound daunting, but it really isn't once you get into the swing of things! I would definitely take this class again!",
            "Professor Johnson is like if a smile was a person. I'm not a massive fan of grammar, but he made it fun, useful, and easy. I love this man with my entire soul",
            "He is the sweetest. He really wants to help you. He teaches at the pace the class can handle which I really appreciated. If we were not ready to be quizzed on a topic, he would wait until he felt like we were ready. You have to do the homework and put in the effort. If you want to do the minimal amount of work, this is not the class for you.",
            "He gives at least 1-2 quizzes per class and then you switch quizzes with a partner and grade them. And then, he goes down the attendance list and everyone reads their grade-not good. and this happens-every single class.",
            "Johnson is really cool. I had my doubts about this class but he makes it a lot of fun. Expect lots of class discussions with very few actual lectures. There are three papers, a midterm, a final, and some quizzes spread throughout the semester. The papers aren't that hard and he gives you clear instructions. Would take again.",
            "Johnson is the man! Love his class. His is so nice and super helpful when it comes to giving feedback. He wants you to be successful & states exactly what he expects from you. lets you venture your own path when it comes to the writing assignments (theres 3). There are daily quizzes in this class but if you do the readings, they arent hard at all.",
            "Definitely suggest taking him. Interesting readings, great lectures, funny guy. He can be a bit of a tough grader on papers, but it will only make you better, and he's totally willing to work with you. Great class, awesome professor!"
        ]
    },
    {
        "id": 73,
        "first_name": "John",
        "last_name": "Xiao",
        "similar_professors": [
            "Ibra Fancher",
            "Timothy Yarnall",
            ""
        ],
        "ratings": [
            "The class has some very tough concepts, but I don't think Prof. Xiao was bad at all. Lab counts for a big part of your grade too, so even if you don't do great on the tests, labs and homework can still hold your grade up (worked for me) Lectures were boring, but helpful at times. He does have you submit something for attendance every class.",
            "The lecture was completely useless so I stopped going. The tests were very easy and often just taken from the past exams that he gives you. The labs are horrible and so hard but that's not his fault. He started giving codes in class that you have to type into canvas to show you were at lecture which sucked. Homeworks on webassign was very nice.",
            "He is the worst professor I've had so far at the university. Says he'll give partial credit but never does. There were two exams and the final. The average for the first exams was in the mid 50s and the average for the second was a 46. After failing the class, he'll tell you it was a simple exam. AVOID AT ALL COSTS!! Wish I could give a 0 rating.",
            "Xiao is one of the most harsh graders at the university. His slides for lecture always have errors, so students are studying wrong information. He does not curve exams at all, even when the class averages are in the 50s and 40s. Grading on exams is unfair, since he takes off a ridiculous amount of points for the smallest mistake. Steer clear.",
            "Worst professors I have taken at this university. Homework's do not align with what we learn in lecture (learn nothing in lecture). Quizzes are homework questions with partial credit awarded. Exams are homework questions in which no partial credit is awarded. Class exam average in 40's no curve. An embarrassing professor for the department to have.",
            "Can I rate any lower than a 1? His slides are a disaster. He constantly makes mistakes on them and doesn't fix it so we end up studying the wrong answer. He doesn't give any partial credit on his exams. His grading is all over the place. The entire class failed the exams and he said it was us not him. He expects his test average to be 54%. RUN AWAY",
            "Just don't take Xiao's class. The average on the first exam was a 57 and the second exam was a 46. Both exams were not curved. His lectures are beyond boring and completely useless as he just points his laser pointer at the slides that are full of mistakes (which he won't fix). If you don't have to take his class, don't; and if you do, I'm sorry.",
            "Xiao isn't a bad prof, but you will have to work at it. He gives minute papers so you can directly ask questions and get 5% of your grade just for paying attention. Labs are miserable but I think that's more of the department's problem. He re-uses old test problems and examples from class so if you do his practice exams you'll be fine.",
            "This is the only class where I've sat down and actually put work into an assignment and still gotten a 0 on it. Lectures & labs are a waste of time but are mandatory. He goes on lecture long tangents about applications, but when it comes to the problems you'll be tested on he just says \"it's a very simple equation, very easy to solve\" then goes on",
            "Worst professor ever. Not approachable. Condescending."
        ]
    },
    {
        "id": 74,
        "first_name": "Kathleen",
        "last_name": "McCoy",
        "similar_professors": [
            "Katherine Wassil",
            "Nazim Karaca",
            ""
        ],
        "ratings": [
            "gau",
            "great",
            "Very soft, encouraging, and kind. Gives great feedback and really helps with writing. Does one on one meetings with students in order to make sure each one gets in depth feedback on all papers.",
            "On new graduate student orientation, professor McCoy as our chair gave an inspirational speech to welcome everyone. She has the vision of a real scientist, and her speech connects to my heart. I feel that I could be someone that really use my research to change the world. I want to thank her for extending my funding, a great caring professor.",
            "Very good prof. Took 3 classes with her. Tends to give good grades if you give a decent effort. Some classes are focused very much around discussion instead of technical learning ... for better or worse.",
            "While she is a very kind person, who genuinely does want to help, half the the time she seems like she has no idea what she is doing or talking about. We spend a lot of class time watching her try to figure out how her computer works. She constantly second guesses herself which leaves everyone very confused.",
            "The class is basically based on the lab. Unfortunately the lectures sometimes don't cover lab material in time so you find yourself stuck sometimes. Office hours are going to have to be part of your schedule to pass. Oh, and it's a problem when a computer science professor doesn't know how to hook a laptop up to a projector.",
            "Just wants to help but was not very good at explaining herself. Her classes are behind the labs so you will show up to lab and just be sitting there clueless and the Lab TA's do not help at all. It's pretty bad because it could have been a great class if taught right.",
            "Very good professor who really wants to help her students understand computer science. If you are having trouble understanding the material by all means, go to office hours. She is extremely helpful and will help teach you through the labs explaining the concepts necessary to complete them.",
            "She is a very nice woman who definitely means well but most of the time she seems really confused. She spends too much class time going over old material and barely addresses new material that we need to know for labs. We didn't learn Java but were thrown into a java lab. i recommend taking another professor."
        ]
    },
    {
        "id": 90,
        "first_name": "Alan",
        "last_name": "Fox",
        "similar_professors": [
            "Aaron Fichtelberg",
            "Jeff Jordan",
            ""
        ],
        "ratings": [
            "If you do bad in his class thats %100 on you. These reviews are crazy. Show up and put some effort in and you're golden. These kids just don't wanna put in an ounce of work. Even if you miss sometimes you're perfectly fine. Literally just try. When you read a bad review just know they did not do a single thing in his class once. Easy. Just try.",
            "Genuinely one of UD's treasures, by far the best professor I have ever had. You will have to read (a lot) and you will have to participate, but if you can put the work in I doubt there is a more rewarding class to take at all of UD than one taught Professor Fox.",
            "Dr. Fox makes you think! This class is discussion based. The best way to get a good grade in this class is to read the assigned material and participate! Ask questions and take notes! That being said, you don't need prior philosophy knowledge to be successful, just a willingness to learn. Exams are take home and essay style. You will learn a lot!",
            "If you want a good grade in this course make sure you participate! The midterm and final were essay based and open notes. Not too many assignments and the lectures were pretty interesting.",
            "I went into this course thinking I would have a religious studies minor. Not only did Alan ruin my love of religion, but he ruined my semester. I can genuinely say I have never had a professor as terrible in my life. He is disorganized, unprofessional, and makes offensive jokes. He will shame you for any incorrect answer. Don't even consider taking",
            "Not great, don't recommend.",
            "Be prepared to read and write a ton. His superhero colloquium requires papers due almost every class, with extensive reading required to do well. If you don't have previous knowledge of superheroes, be prepared for a low participation score. Discussions in class are hard to follow and participate in if you are not an avid reader of comics.",
            "All assignments are either papers or exams. You will be graded on attendance. Prof is very nice and entertaining but shows some gender bias. There are SIX textbooks which are rather short and inexpensive, but you will be reading at least 3 chapters per week if you want to pass.",
            "The worst professor in the United States. Professor Fox really hates every living being beside himself.",
            "Anyone who dedicates their career to the PHILOSOPHY of RELIGION is a red flag. At first, Fox seemed ok but when it came to grading, if you weren't handing him scriptures straight from Jesus it wasn't good enough. Anything discussed in this class is a difficult concept to grasp and if you can't get it right away you're screwed. DONT TAKE IT."
        ]
    },
    {
        "id": 92,
        "first_name": "David",
        "last_name": "Bellamy",
        "similar_professors": [
            "Amanda Seiwell",
            "Daniel Hayes",
            ""
        ],
        "ratings": [
            "Mid teacher",
            "He is very unorganized but he focuses on the grammar and making sure you understand how to use each word and conjugation properly. You do get graded on your attendance but if you still turn in your work and show an understanding of the material he will cut you some slack. He gives you until the end of the semester to make up any written or online.",
            "Professor Bellamy is not a good professor at all. His grading system consists of a homework grade and a test grade, and whichever is lower is your average. 2 of the tests are kind of easy, but one is very hard and it will ruin your average. He is also not good at explaining anything.",
            "Professor Bellamy is not as bad as he seems the first week of class. He doesn't have a Sakai or Canvas page so you must keep track of your grades yourself, but he is a great professor. Homework is hard, but you do not have to complete all of them to get an A. Exams are the easiest part of the class, which is a nice change of pace for a math class.",
            "This class is really dumb and easy. The grading system seems hard but he is very generous with points. Half the class didn't take the final because he said it couldn't hurt your grade and we already had A's.",
            "At first, Bellamy seems awful. Discrete is a pretty tough subject and he is unorganized as can be. He writes out long boring proofs that you can pretty much space out and ignore a lot of the time. However, even though his grading scales seem super weird, if you put in a decent amount of effort in it is actually fairly easy to get an A.",
            "His lectures are so frustrating: he just stands at the board and rambles on without actually checking if you understand it or not. He gives a normal amount of homework which are pretty hard, but the test questions are always easier than the homework. You have to put in a lot of individual effort in order to do well.",
            "150 points is an A and you get points for asking questions, going to class, and doing proofs. If you put the work in you'll get an A.",
            "He uses a point-based grading system for all of his classes, so if you put the work in early, you don't have to take the final or show up for the last few weeks of class. Get up to the board to do some proofs as soon as possible.",
            "The class is not tough like people talked about, but this professor is not good one to take. In the class, he just follow his thoughts to talk in spite of whether students can follow or not. handwriting is confusing."
        ]
    },
    {
        "id": 94,
        "first_name": "Florence",
        "last_name": "Schmieg",
        "similar_professors": [
            "Beth Ranauto",
            "Jacob Dums",
            ""
        ],
        "ratings": [
            "The professor's lectures are honestly useless because she either focuses on one topic or jumps around from topic to topic with no control or thought throughout the class. You're better off skipping and just teaching the material yourself from youtube. It's easier that way.",
            "Love this class!! 10/10",
            "Lectures go in circles and powerpoints are just pictures from the textbook. You dont have to go to class unless its a PBL day (which she says in advance). If your PBLs are extremely detailed, you will do well. Tests are MC& very hard. I didnt go to class,but studied for hours&read the book and got an A. She has a hugeee curve at the end (84 & upA)",
            "This was one of the worst classes I have ever taken. The powerpoints were unclear, and she talked in circles the whole time. She gave maybe 30 seconds to write down all of the information on a slide, which never made sense anyway. It's better to just skip class and watch Khan Academy videos and then rely on the curve for your final grade.",
            "She was not a great professor. She was very hard to understand and her tests are nearly impossible. Most of us got Ds and Fs on the tests, but she adds a huge curve at the end of the semester.. Group projects and lab will bring your grade up. Don't buy the textbook. Good luck!!",
            "Lectures are scattered and very confusing- sometimes she throws in unnecessary details. Use the textbook and her PPTs on sakai for clarity. Despite her confusing lectures she is such a nice lady and is willing to help her students as long as they ask. Go to her office hours if you're confused about a topic and she will likely help you!",
            "I really liked Dr. Schmieg as a person, she was really nice but a confusing professor. Although her tests are hard everything is curved and the labs really helped with grades so don't worry! Taking ap bio in high school was a big help. The textbook helped me a lot.",
            "You could study for 30 hours for Florence's exams and still only get a 44. But don't worry, group PBL's and Bio Lab and her curve will boost your grade to at least a C! Don't bother showing up, getting the textbook, or even studying for that matter.",
            "The class is all memorization, and not nearly as difficult as everyone makes it seem. If you have background in bio already, then it will be a piece of cake. Otherwise, if you just skim the chapters the night before the exams, then you can get an A pretty easily with minimal effort. 84 and up was an A. Not the best prof, but it's an intro course",
            "Hard class but if you took AP Bio you are set. Be prepared to teach yourself after each lecture. You have to knit together bits and pieces of her lecture and make connections she doesn't point out in class. Tests were easy for me but very hard for others. She gives practice tests but you really need to understand the material thoroughly."
        ]
    },
    {
        "id": 98,
        "first_name": "Julio",
        "last_name": "Carrion",
        "similar_professors": [
            "Kassra Oskooii",
            "Daniel Kinderman",
            ""
        ],
        "ratings": [
            "Great teacher, makes things easy to understand. Really important to go to his exam reviews, they help so much if you have missed a class or two.",
            "Four 4-5 page reflection papers, two all written exams, one group speech project and one final take home 10-12 page essay. There's a fair amount of writing in the class, but it isn't terrible because he's not a super tough grader. You have to put in work in the class, but show an interest, work hard and you can get an A.",
            "The whole class is Dr. Carrion reading off of slides that are word for word from the textbook. The TA was super unhelpful and could not correctly answer questions with problems in lab. The lab portion was a waste of time, only one or two concepts from lab was applicable for the final paper.",
            "Dr. Carrion is amazing. He is so funny, passionate and knowledgeable about everything. It's really important to do the readings in order to do well on the exams, but I sort of did them and pulled off a B+. His class wasn't a joke but it was really interesting and enjoyable. I highly recommend him and this class!",
            "Only took this class since it was required for all Political Science majors, but it has no actual politics discussed. He gives weekly hw assignments and three or four tests, all written no multiple choice. Plus you have to learn to program SPSS and write a 14 page on it. Did not enjoy but got through it. Said he'd curve the class but never did...",
            "Mi estimado Carrión, always be looking out for you. I love his class. I would definitely take his class if I could. Very clear: 4 short essays, 2 exams and 1 take home (12-15 page paper).",
            "Highly recommended. Great professor who cares about his students. 2 exams, take home final, and 4 easy short response essays. There is a fair amount of reading and material, but it's straightforward.",
            "Two exams and one final paper are all that is needed for this class. You can show up to class, but as long as you read the assigned papers a week before the exam, you should be fine in this class.",
            "If he's as good at barbecue as his son is then this guy is legit!!!!!!! Also adorable!!!!",
            "Excellent professor. Highly recommend his course. Very knowledgeable and friendly."
        ]
    },
    {
        "id": 100,
        "first_name": "Evangelos",
        "last_name": "Falaris",
        "similar_professors": [
            "Dan Alia",
            "Enas Eljamal",
            ""
        ],
        "ratings": [
            "One of the worst classes I have ever taken. The lectures were boring, he solely read off the slides. The exams were fairly difficult and stressful because they were the only thing that counted for a grade. You never actually know you grade either because he goes off of the class average for grading, so we never really knew.",
            "Our entire grade is comprised of 3 multiple choice exams. They weren't too difficult it made them far more nerve wracking as there was no breathing room to mess up on even 1. Plus his lectures are incredibly boring, al he does is read off a powerpoint, I think I fell asleep the entire first month. He was a alright guy but the course was just lazy.",
            "Very easy course & informative. Attendance is not mandatory but watch the lectures before the exams. No assignments others than the exams so watch the lectures and do the 10 practice problems for each test. EXAMS ARE MULTIPLE CHOICE. I retyped all the notes along with the recordings at 1.5x speed and it's an easy A. Little dry but easy to follow!!",
            "Absolutely awful professor. Lectures are so boring and have so much information in them. Exams are so much more confusing than the practice questions. The only grades for this class are 2 midterms and a final. DO NOT TAKE THIS PROFESSOR. trust me. avoid.",
            "This guy sits in front of the class and lectures for an hour and 15 straight with no interaction with students, expects you to know an insane amount of material that culminates to a midterm worth 33% and a final worth 67%. Had a B+ at the midterm and finished almost failing the class. What the hell",
            "The book is useless, participation isn't mandatory, and he puts his slides online. The final is cumulative, and it absolutely sucks studying for. He's very knowledgeable but his lectures are boring, especially when nobody comes to class. Only 3 exams.. straight forward class, but very hard to get an A in. Take class if necessary, avoid if possible.",
            "Nice guy who has straightforward expectations. Above all else, study the outlines!",
            "Class is a bit boring, which is ok with me. Don't let other comments saying that it's an extremely easy class fool you. You'll have to know your stuff pretty well. It's not just what I personally think, it's agreed among all of the classmates I know. Hard work won't be equal to A, but a HARD HARD WORK. I got an A by the way. And I learnt a lot.",
            "The topics and information taught are interesting. Tends to jump around a lot when he lectures. Not very clear on what you need to know for the exams. Exams do not assess what you learn in class and how much you study. I would not recommend him.",
            "Not a tremendously difficult class, but not an easy A. Entire grade based on 2 exams and a cumulative final. Exams are multiple choice with a few short answer questions. Exams are somewhat difficult to study for because they cover a lot of material and it's not exactly clear what you will be tested on. Overall an OK class."
        ]
    },
    {
        "id": 102,
        "first_name": "Charles",
        "last_name": "Link",
        "similar_professors": [
            "Elizabeth Bayley",
            "Jens Schubert",
            ""
        ],
        "ratings": [
            "Dr. Link knows A LOT about economics! Sometimes lectures get boring, you have to learn on your own, he uses old style lectures, and he does not tell you your grade on Canvas which sucksss. Don't procrastinate, study before exams and you should be fine. 3 main course components: exams, modules, and problem sets.",
            "Dr. Link is very smart and very passionate about economics. You won't meet anyone more experienced than him. As a teacher, he isn't bad per se, but explains things in an overly complicated way. I found that the Asarta videos and other online resources were more helpful than class oftentimes. The tests are very fair, though.",
            "Link is the best, go to class, do your homework, and do the practice exams and you will be fine.",
            "A great choice and should be an easy A. He gives practice exams for all of the tests which are really helpful. In addition, he makes the average a B-. For example, if the average on a test in a 68, that is a B- so a 84 or 85 would be an A. His lectures are outdated but they get the job done and clearly teach you the concepts. Would recommend!",
            "Love Link, think he's a great guy, but he is not the best teacher. His lectures are very confusing to the point that I stopped paying attention. He tries to be helpful, but ends up confusing you more. This class was very hard for me, but he did give a good curve at the end.",
            "Dr. Link made economics interesting and easy. You don't need the textbook because he gives you most of the notes, and it's easiest to just show up for lectures. He makes class engaging with dance and joke breaks, and gives some of the test questions and answers on the sample exams, especially for the final. Some grades are completion-based.",
            "He's a very nice guy so long as you're respectful. His main problem is that he can over-explain things, by that I mean he can clump so many concepts into one explanation that they become so complicated in your head. My advice: watch the optional Asarta videos, they explain things so simply and each are about 3-5 minutes.",
            "Everything is all set up for you at the beginning of the semester. Homework due dates, exam dates. Lectures are super boring, but that's microeconomics to me in general. Link is a good Professor, he even has practice exams for each exam we take. I would recommend to take him.",
            "If you don't understand econ, you won't understand the class. He locks your grade so you have no idea how you are doing all semester, and he doesn't make it easy to calculate your grade. He gets annoyed when people email him, and his responses to emails are usually short and unhelpful. He doesn't explain content very well, so you have to study hard",
            "Although he isn't the best with technology, he still can properly teach microeconomics. Professor Link is extremely passionate and knowledgeable when it comes to economics. He's a little quirky, but that's what makes his lectures interesting. I would definitely take another class with him again."
        ]
    },
    {
        "id": 104,
        "first_name": "James",
        "last_name": "Brophy",
        "similar_professors": [
            "John Russ",
            "Melissa Maestri",
            ""
        ],
        "ratings": [
            "Prof Brohpy was a great professor. He is very passionate about history, which means his lectures were filled with a lot of information and took up the entire 55 minutes every class. There was one extra credit assignment that added a few points onto a test grade. You need the primary source reader but you don't necessarily need the textbook.",
            "Dr. Brophy is by far my favorite professor I've had at UD. He is super passionate about the subject and made lectures about a topic I didn't particularly care about before taking class super interesting. Highly recommend. Also, you need the primary source reader but can skip out on the textbook (never used mine).",
            "I don't even like history but I loved taking this course. I also had him for the discussion section and he made the topic interesting and the class engaging. He's very passionate about history which makes lecture enjoyable. I highly recommend taking one of his courses even if it's just for a breadth requirement.",
            "Dr. Brophy is a good professor for 268, but this seminar requires lots of reading that other 268 profs might not assign. You have a book review, two primary analyses, and a final research paper (the draft and the final are each worth 20%). He does provide good feedback, but it can be a lot. We did not cover European history as much as I wanted to.",
            "Professor Brophy was definitely a highlight of this semester. He made a class I just took as a breadth requirement actually fun and very informative. He's amazing.",
            "Very good lecturer, makes the 50 minutes fly by. Attendance is mandatory, but you will want to come. Generally a very nice person and very open to discussion. There is a textbook, but I found it is supplementary to the lectures and I didn't open it at all.",
            "Professor Brophy has easily become one of my new favorite professor's at UD. The class is definitely very stimulating in terms of the conversations that go on because he is extremely knowledgeable and passionate about the topics at hand. He definitely is a tough grader but gives great feedback that you can use to improve upon your writing with.",
            "Dr. Brophy is amazing but challenging in good ways! I enjoyed having him as a professor although I specialize in American history. Very understanding and is flexible with extensions if you show up and participate. Lots of reading, writing, and book reviews but it definitely prepares for your future in history.",
            "Professor Brophy is an excellent professor who really cares about his students. There are a lot of writing and reading assignments, but he is clear with what he expects and he makes discussions interesting. You have to read everything he assigns because the class is a seminar.",
            "He assigned a lot of papers, most of which based on books we read and a research paper, but I had no problem with this. My major is to write about history, so I can't complain about that. He was insanely flexible with due dates and pushed back tests and papers a couple times. I accidentally submitted my final late, but he was very understanding."
        ]
    },
    {
        "id": 107,
        "first_name": "Chris",
        "last_name": "Boorse",
        "similar_professors": [
            "Aaron Fichtelberg",
            "Jeff Jordan",
            ""
        ],
        "ratings": [
            "Awful at teaching, doesn't explain anything. Starts every answer off with \"obviously...\" and doesn't explain why it's so obvious. Thinks way too much of himself. If you can teach yourself from a textbook take it, otherwise don't. Don't expect a change in grades either.",
            "Brilliant professor who's occasionally pretty funny. HW is not graded but it is helpful and going to class all the time isn't entirely necessary as long as you review the course notes and study the text. Let's you retake one of your exams but the class is not too difficult if you put the time into it and practice. Take logic with Boorse!",
            "Terrible professor. He moves very quickly in class, just write stuff down and try to understand it later. The material itself is not too difficult, there's just a learning curve. Takes a while and some work to click, but once it does, you're golden. TA is very helpful. DO HOMEWORK! Not graded, but it helps you. Other than that, textbook is useless.",
            "Boorse is pretty awesome. I'm taking his class now and loving it. He likes what he does and he's pretty funny (he cracks himself up). If you go at least to the last few classes before an exam you should be fine. He goes over everything and gives practice tests. 3 tests and homework.",
            "Dr. Boorse's advanced logic seminars are excellent. They're small classes designed to teach about a specific part of mathematical or philosophical logic. Boorse knows his subject well, he is flexible in what he teaches, and he develops a good rapport with the students. I hear he might be teaching a seminar on deviant logic in spring 2011. Take it.",
            "Do NOT listen to anything anyone else is saying, the class is useless, its hard, you can't pay attention and learn much because its not structured at all, take something else if at all possible",
            "Amazing professor. Keeps me interested and laughing all whilst learning :) You MUST take this hottie's class!!",
            "Greatest professor that has ever walked the earth. You'll learn tons about Basic Decision Theory and lots about other things too. And he has a pepper now.",
            "Was very interesting and informative... clearly had a good grasp on the subject matter. Was very funny and kept the mood of the class light. Take the class for an interesting Group A.",
            "Between an extremely well written text book and a professor who knows logic like the back of his hand you will be well off. Do the homework, yes it takes a long time, but compared to the homework the tests are a relief. You don't have to even like math to get into the puzzle solving of Logic. Just flow with it. Tutoring is available for free."
        ]
    },
    {
        "id": 110,
        "first_name": "David",
        "last_name": "Smith",
        "similar_professors": [
            "Ibra Fancher",
            "Timothy Yarnall",
            ""
        ],
        "ratings": [
            "The man came off very distant, cranky, and rude. Can recall when he actually kicked me out of his office for asking too many question. Regardless, the guy is still the best BISC403 prof in UD. His lectures are typically clear, and his exams are hard but doable if you put in time with notes, the book, and the practice exams. Scored a B. So can you.",
            "TAKE SMITH!!! This class is a difficult class, but an A is possible. Dr. Smith is extremely helpful and for an 8 AM keeps everyone wide awake. One of the best biology teachers I've ever had I recommend him!! Take Notes on everything, study practice exams, read book and you will get a A or B",
            "Dr. Smith is very enthusiastic and knowledgeable about genetics. However, is exams are very tough. Be sure to thoroughly understand his notes and previous exams.",
            "Dr. Smith is very passionate about what he teaches and usually willing to help. Make sure you go to class and take good notes because tests come straight form the notes. You won't even need to read the book. He is very good at explaining things so that they make sense too. If you have to take this class, definitely take it with Smith!",
            "Take really good notes in this class, the exams come right out of lectures. Also, study the old test really well (understand all the questions). Overall, he explains things well and is willing to help you. Not too hard of a class, but make sure you study and UNDERSTAND concepts. Read over the assigned readings, it may help clear up some concepts.",
            "I had heard that this class was hard, but it is very easy. If you know how to read, you will do well. If you do not know how to read, you will do well.",
            "Dr. Smith is extremely knowledgeable and enthusiastic about his area of study and it clearly shows in his teaching. The material is challenging, but you should do okay if you pay attention and take good notes. The lab section of this class is horrendous, but you just have to grit your teeth and do it. Smith makes 8am class not entirely terrible.",
            "Liked him so much for 300 I took him again! Wants his students to do well, holds study sessions @library the night before exams. Gets along with students and is very helpful to them. Enthusiastic about what he teaches, tests are very fair, easy to do well if you study. Will clarify anything you ask. Good teacher, smart prof, great guy.",
            "Dr. Smith is somehow able to take an 8am class about bacteria and make it interesting enough to stay awake for! His lectures are very interesting, and he is very easy to find outside of class if you have questions. Exams are tough, but he gives you old exams to practice off of.",
            "I was excited for this class, but the first few months were dedicated to punnett squares and simple mathematical calculation. Then suddenly everything became route memorization. Tough. Note: Do not do the difficult book problems he assigns for the first exam. There will generally only be easy ones on it. -READ THE BOOK-STUDY OLD EXAMS LIKE WOAH-"
        ]
    },
    {
        "id": 111,
        "first_name": "Douglas",
        "last_name": "Stalker",
        "similar_professors": [
            "Aaron Fichtelberg",
            "Jeff Jordan",
            ""
        ],
        "ratings": [
            "Arguably... One of the most intelligent men I know, he'd be set with these upset students that don't want to pay attention and dick around all day long... imagine paying to take a philosophy course only to either not do the work because your unsatisfied. I'd pay Douglas stalker to teach my kid about philosophy personally.",
            "Gives an old time lecture; uses overhead projector; helps to go to class because each lecture assumes familiarity with previous; average grade just over a C; only one text; many handouts online explaining text and lecture topics; tests multiple choice; results curved; covers main problems of philosophy from analytic view.",
            "badness all around",
            "This class is painfully boring. He seems like a very nice guy, he isn't afraid to use his own odd form of wit, although some people find his wit awkward, I respect his comfort level up there when he is teaching. The class sucks though, it is difficult kind of, and his teaching style/voice/material is obscenely boring.",
            "He seems like a nice guy, but his lectures are pretty ridiculously boring. His tests are really hard, but he curves them. On the first exam (out of two), I got the second highest grade in the class with an 82. He's knowlegable and friendly.",
            "after the 3rd class I went to Dr. Stalker's office hours with a good question, which he answered and we discussed. I totally understand everything that he says in class and am not suprised when he is mean to stupid people. If you ask a stupid question what do you expect, especially from a guy with severe chronic back pain. Quit whining!!!",
            "The reason no one likes this man is because the majority of his students are idiots. If you ask a worthwile question he will answer, and will be very willing to help. However, if all you want is a better grade than you deserve than of course he will be mean to you, and should be mean to you because you are stupid and dont deserve to be at a college",
            "I found the discussion of the lottery paradox especially interesting. I'm now a determinist!",
            "Multiple-guess exam format--just 2 a semester (easy in that respect if you can manage to avoid drifting as much as Stalker). He is the worse teacher I have had at UD, although he has written on many interesting and related topics and knows a lot of the people we studied.",
            "terrible"
        ]
    },
    {
        "id": 114,
        "first_name": "Thomas",
        "last_name": "Peeler",
        "similar_professors": [
            "David Richard",
            "Matt Persons",
            ""
        ],
        "ratings": [
            "I did well in Dr. Peeler's Molecular Biology class, I just found it very boring and such basic biological information that I found it hard to concentrate in class. He also just lectures the entire class and his voice is quite boring. If you want an easy A though, take his Molecular class.",
            "Peeler was a very nice professor. Sometimes his grading was really harsh and other times you got an easy A. I would recommend him!",
            "I loved Dr. Peelers class! He even brought in his dog on the last day. Lays out everything you need to do to succeed and if you put in the effort, he notices. Gives great advice too! Cant wait to have him again for cell bio next semester!",
            "Clearly explained assignments, structured well, approachable, great professor",
            "He is a really nice professor who is clearly highly intelligent.",
            "Great professor! Dr. Peeler is extremely friendly and a fair grader. He also makes the class not as difficult as it could be by allowing students to create PowerPoint projects as a grade booster. Many science classes are solely based on exams, but he purposely creates opportunities to raise your grade if you're not the best test taker.",
            "I've heard he's awesome at teaching other bio courses, but genetics just isn't one of them. He rarely every lectured, so you were stuck depending on your group to help you understand the material. He always assigned readings from the textbook and we would almost always had a quiz. His exams are hard. Labs & essays barely saved my grade.",
            "Took genetics with him and it was horrible. He rarely teaches or ever lectures. you must do the readings and during most classes there is a quiz. exams are hard as well. he's very laidback and willing to help if you have questions. got out of class early 99% of the time. lab reports and essays are what saved my grade.",
            "Core Perspectives is interesting. Very laid back and not a hard grader. Pretty good teacher though.",
            "Nice guy, but class is sleep-inducing"
        ]
    },
    {
        "id": 127,
        "first_name": "Riley",
        "last_name": "Maynard",
        "similar_professors": [
            "Cory Byers",
            "Josie Degroot Brown",
            ""
        ],
        "ratings": [
            "Riley was awesome. Told you exactly what to expect like no other undergrad teacher I have ever had.",
            "Best teacher ever! He really tells it like it is! He may seem stern or mean, but he really prepares you for the industry. Have to take at least one class with him!",
            "Avoid. Feels compelled to constantly insult every student in class for their work, even though he never actually shows how to properly do the assignments. Operates under the guise of \"preparing students for the world\"...only as an excuse to belittle their work. Riley needs to learn what the word Intro...means in Intro to TV & Audio course",
            "the best",
            "a stud!",
            "This is a guy where you will either love him or hate him. I did not like him what so ever. Yes he can crack a joke, yes he knows what he is talking about when it comes to advertising. But he is a jerk. Telling students that their work is sh** and that we don't know anything. If would help if he actually taught something once in a while.Avoid him!",
            "not too bad. doesnt use the book except for take home tests. just turn ur stuff in on time and u'll get an A. def tells it like it is.",
            "Took his class years ago as non-traditional student. I was 29, returning from workforce & extremely focused. Maynard knows his stuff & conveys it well. However, he curses like a sailor & talks to everyone like they were morons. It's offensive & pointless. If not for his bitterness, I'd give him an A, but gave him C, instead.",
            "Media Management. This class seems useless to me. We don't do anything with the book at all besides take home tests with it. Every day we listen to him tell us how miserable our lives are going to be. I'm not learning anything. The guest lectures are the only thing that save this class. He's also very unclear on assignments and the syllabus is vagu",
            "No Comments"
        ]
    },
    {
        "id": 128,
        "first_name": "Duff",
        "last_name": "Wrobbel",
        "similar_professors": [
            "Cory Byers",
            "Josie Degroot Brown",
            ""
        ],
        "ratings": [
            "Duff is fantastic. He's in my top 3 favorite professors of all time, no question. He grades fairly and gives good feedback, but make sure you know when things are due because he doesn't always remind you. Nothing was too challenging, though. Get ready for a fun, laid-back semester if Duff is on your schedule.",
            "I have mixed feelings. Hes super funny, captivating, and outgoing. However, he is unorganized, a tough grader, and the assignment are not explained well at all. & he he seems to get aggravated when you email him about any questions,comments or concerns you may have. So my review is wishy-washy.",
            "TAKE HIS CLASS. I took it as a major elective and it was so worth it. It is also the only class I've taken where I read the entire textbook and enjoyed every assignment. I wish I could have taken this seated, as it would have been even more enjoyable.",
            "Duff is a fantastic professor. He personality that keeps class interesting. He doesn't like to use technology, so get ready to take notes during his lectures. Don't worry, he keeps them interesting. His assignments were very helpful in learning the material. The tests were hard and he gave a pretty vague study guide, but you can still do well.",
            "If you are taking this class for theories (ACS 330) don't be nervous or scared. Make sure you study for the quizzes and read through the chapters. Heads up: MEMORIZE any lists of stuff that are mentioned in the book and he gives extra credit- always over NPR. Amazing teacher. He is genuine, honest, and inspiring. TAKE HIS CLASSES NOW!!",
            "Best professor I have ever had at SIUE. Seriously, take him. Even if you are a biochemistry major, take him.",
            "Listening class, over the summer. Of course, the material is compressed and you go over a lot in 5 weeks. Duff is a great guy, and he definitely has personality. Be prepared to take lots of notes during his lectures because that's where a lot of test questions come from. Speech Comm is my minor, so had to take this class, but he made it enjoyable.",
            "Duff is one of the best instructors here! I love not only going to class but learning from him. He is helpful inside and outside the classroom. As long as you go and pay attention he is not to hard. Great professor!",
            "He is a Great Professor! I learned more from him than anyone else in the department. He also inspired me to be a teacher of Communication.",
            "Dr. Wrobbel keeps the class interesting. Lots of information given, much of it thought provoking."
        ]
    },
    {
        "id": 131,
        "first_name": "Fred",
        "last_name": "Grosse",
        "similar_professors": [
            "Carl Faust",
            "Samya Zain",
            ""
        ],
        "ratings": [
            "Welcher professor?",
            "the material thought was very fulfilling information and he was an easy grader and due dates were very acceptable due dates",
            "Very knowledgeable. Dr. Grosse is extremely experienced and does his best to share his knowledge. He is always willing to help and often goes the extra mile.",
            "not clear, condescending, and not organized",
            "Difficult. he knows his****, but he's tough at times.",
            "I had Dr. Grosse for Physics I and II labs and he was an excellent teacher. He rides a bike to school every day, too.",
            "He really wants to make you think and learn, not just spit back information. He's a great guy who makes physics fun and worth all the work you have to put into the class.",
            "Class & Lab is hard especially w/ him, but he's helpful and understanding if you go to him for help.",
            "from an old alum... i credit dr. grosse with the reason i got my first job and still love working for the same company (for 12 years!). like it or not those COBOL skills and his emphasis on 'work ethic' were key!...",
            "The class isn't easy, but he's a great guy"
        ]
    },
    {
        "id": 132,
        "first_name": "Rachana",
        "last_name": "Sachdev",
        "similar_professors": [
            "Harvey Edwards",
            "Heather Lang",
            ""
        ],
        "ratings": [
            "M",
            "I genuinely loved this class so much because of Rachana. She made me feel so cared about and heard. I also love the fact that all of the projects we were required to do, even the final, were all geared towards us as individuals, and, we were allowed to choose any type of modality to do the project in. Rachana fan club",
            "asd",
            "she is just too excited for it being 10 in the morning.",
            "Nice Professor. Very open to alternative projects if you do not like essays. Had class outside once and brought up out to the campus garden. Grading is easy if you try and she will always proof read essays so you know what she wants.",
            "Sachdev is absolutely wonderful, I cannot recommend her enough! She tries to make the readings as relatable as possible for her students and goes the extra mile to listen to what everyone has to say. She very clearly loves teaching and loves what she teaches, so if you're hunting for a professor who's dedicated to their craft, she's your gal.",
            "Rachana knows how to make her class fun and interesting for everyone regardless of their major or background. She really strives to make everyone feel included and represented and ensures that everyone has a voice in the classroom. She tends to be a bit disorganized, but it's in a fun English teacher kind of way.",
            "Class is long-winded and it's easy to doze- that's just the nature of it, though. Lots of reading but is all online. Requires you participate in discussion 2x per week (at least). Very caring, thoughtful, and a pretty decent professor.",
            "I like this professor and I have had them for multiple classes, however, they often are hard to reach outside of class time. I enjoyed their courses but it was frustrating at times when you need clarification and you are unable to reach them.",
            "Not a terrible class given it was Shakespeare & The Environment. Some participation is necessary. Not a heavy grader and is willing to work with you. However the class focused more on the environmental issues then Shakespeare."
        ]
    },
    {
        "id": 137,
        "first_name": "Mellonee",
        "last_name": "Burnim",
        "similar_professors": [
            "Robert Dobler",
            "David McDonald",
            ""
        ],
        "ratings": [
            "Great Job!",
            "I went into professor Burnim's class with the expectation of learning a lot about Black Music, while still having a good time. I was gravely mistaken. She grades her papers incredibly difficultly, and her tests often have material that she barely, if at all covers. Steer clear of her. If your major makes you take her class CHANG YOUR MAJOR.",
            "For a freshman level class, she's a very tough grader. Also, she doesn't answer your questions and is incredibly disorganized.",
            "I was looking forward to this class and was grossly disappointed. Her lecture information is poorly organized and difficult to follow. She doesn't know how to operate anything electronic including turning off caps lock. Her tone and mannerisms are abrasive and obnoxious. Expect to get a snarky response when you ask her to clarify herself and exams.",
            "EXTREMELY BORING CLASS. also did not like the teacher at all.",
            "Worst professor I have ever had. Doesn't listen to students at all. Thinks everything she says is great and useful (It isn't.) Very rude and doesn't return emails. Grading is absolutely ridiculous and she very opinionated and hard to deal with. She tries to be fun but her class is a bore and is terrible to sit through. I give her a huge F--",
            "she plays favorites with students. She also tends to listen to students poorly - she makes a quick judgment about what you are saying and then doesn't listen to your whole idea. Very ethnusiastic though",
            "mEAN",
            "i did not enjoy the class",
            "For a Doctor of Ethnomusicology, this woman seems to have an awfully difficult time operating a microphone. Every day in class her voice was feeding back through the speakers, people were cringing, and guest performers were freaked out. How do you think her fieldwork recordings sound? \"Scree!!\""
        ]
    },
    {
        "id": 141,
        "first_name": "Mark",
        "last_name": "Wardell",
        "similar_professors": [
            "Andy James",
            "Andy Mowery",
            ""
        ],
        "ratings": [
            "Grades on class participation but argues any point you bring up making you not want to participate.Very combative. He is ALWAYS right.Comments on paper are not helpful.Not a good communicator of expectations on assignments. If you can get through all of that, there are moments when he says something profound.",
            "I like to participate in class, but I thought the material was dry. So sue me; I was bored!",
            "Dr. Wardell receives so many negative comments because you actually have to engage and be participative in class. What a novel concept. The material I learned in his class nearly three years ago still has me thinking about labor theory, especially now that I'm in \"the real world.\" He looks like Steve Martin but I don't think he's a Jerk.",
            "I agree. He'd probably be better off in Boone, NC.",
            "No Comments",
            "While he bears a passing resemblence to Steve Martin, that is about the best thing I can say about him. The term \"reprobate\" comes to mind.",
            "Disgusting individual.",
            "When we reflect back on our college experience, will we still think the material is \"dry\" after taking his class? ZZZZZZZ",
            "He embodies the \"Peter Principle\" to the maximum- he surpassed his level of competency several stages past. \"Those that can't do, teach....those that can't teach, become administrators!\"",
            "Dry material, Professor makes it fun. Dr. Wardell is about elevating one's ability to write and think. Read the readings, do the work, don't take the red markings personally and when you reflect back on your college experience, this class will stand out as one of the best."
        ]
    },
    {
        "id": 142,
        "first_name": "Paul",
        "last_name": "Clark",
        "similar_professors": [
            "Bruce Tirrell",
            "Dorothea Roumpi",
            ""
        ],
        "ratings": [
            "Prof. Clark is one of my favorite professors! He is so funny, and genuinely cares about his students. His class is fine as long as you take notes and do the readings. Great guy!",
            "Overall, a pretty average class experience. The exams weren't terrible and there was not a crazy amount of work. Lectures definitely get boring and attendance is mandatory if you want the notes, but I have definitely had worse.",
            "13 min 25 questions and questions from out-class reading and 4 or more 30+ pages PPTs.",
            "Attendance is mandatory, must go to get the blanks to slides which will be what is on exams. Exams open note but the class average was often still a C or low B, must have a good note sheet to do well. Does not provide missing work for almost any reason. Hard grader, very nit picky. Do not go on your phone in class, will get mad. No textbooks needed",
            "Dr. Clark is by no means a great professor. His lectures are difficult to listen to, as he just drones on for the whole class. You will never get out of class early. Attendance is graded daily through tophat. He is not an understanding guy, but his TA was. All assignments are due at the beginning of class, and are not open for late submission.",
            "I did not think Professor Clark cares about students at all. I think he approaches teaching like a chore.",
            "Very nitpicking grading on assignments where he will take a point off for little things. Exams are very straight forward as questions are straight from the slides. Must show up to class to get participation and slide blanks.",
            "Professor Clark was easily my favorite professor this semester. The notes are PowerPoint slides that you fill in the blank. Taking notes, doing the readings, and studying, will make this class easy.",
            "There are other sections of ler 100 that you can take instead. I dont think hell be winning any teaching awards any time soon",
            "The tests contain information that was clearly laid out in the powerpoints we fill out in class. If you don't come to class, you will miss the \"blanks\" he has in the powerpoints so you will miss out on info that could be on an exam. Just pay attention in lectures, do the TopHat questions, and study good before exams and you will earn a good grade."
        ]
    },
    {
        "id": 147,
        "first_name": "Perry",
        "last_name": "Lentz",
        "similar_professors": [
            "Alex Brostoff",
            "Orchid Tierney",
            ""
        ],
        "ratings": [
            "I had her for College Transfer, the class is easy as long as you know what you plan on doing with your life.",
            "As a freshman at Kenyon in 1984, I took Mr. Lentz's literature class. I graduated from law school, was elected a prosecutor in Montana shortly thereafter, worked as a prosecutor in New Mexico, in the financial industry in Singapore, and to this day, I find Mr. Lentz's class one of the most relevant classes I ever took even though, unfortunately I",
            "I took this class 7 years ago but I still remember that he made me cry. We had \"recitations\" (short, a handwritten page, answers to prompts on the text we're reading) and he said I should withdraw from the class because I did poorly on 1! Otherwise averaging a B/B+. He may be the reason I dislike early American Lit (in grad school for Lit).",
            "Simply the best professor I have ever had. His 50 minute lectures are phenomenal and his knowledge of the subject matter is both encyclopedic and still growing. He insists on 2 things-punctuality and familiarity with the assignment. If you cannot do the reading and show up on time do not take his class. If you can, then do.",
            "It turns out that the \"Charles P. McIlvaine Professor of English\" isn't even up to date on literary criticism in his field. His lectures are informed by some scholars who were prominent in the late sixties. UGH!!He's a kind man though.",
            "He is a wonderful professor. I took his american lit class. It is challenging and some of the books we read weren't my favorite, but he is great! He is one of the kindest people I have ever met. It is annoying that his office hours are really early in the morning, but you should go anyway.",
            "No! Just No!!!! Thanks God he's retiring. His new book is a catastrophe on paperback, too. People should realize that big words don't make a good teacher.",
            "A truly devoted professor and wonderful mentor. He lives and breathes literature, and he really inspires his students to work hard and react personally to the text. Kind, perceptive, and invested in his students. If you want a challenging but fulfilling English experience, take a class with him. It's so sad that he's only here for one more year!",
            "You either love him or you hate him. No inbetweens. I LOVE HIM! Amazing professor and human being.",
            "I admit I'm rather baffled by all these accusations of misogyny. Mr. Lentz has thus far always treated my as a complete equal. He's an absolutely extraordinary lecturer and has always made time for me in his office hours as well, whether to discuss the text or just to talk over whatever I've been reading on my own."
        ]
    },
    {
        "id": 150,
        "first_name": "Nancy",
        "last_name": "Levenburg",
        "similar_professors": [
            "Ben Walsh",
            "Bruce Ballard",
            ""
        ],
        "ratings": [
            "okay. nothing special, really boring class. hoping to get a B. she is dry but nice. final is not cumulative.",
            "An intelligent lady, absolutely no idea how to teach the material. Whatever you do, do not take her.",
            "Prof. Levenburg is a very tough grader. She graded every sentences of your analysis and offered a 2-page feedback. Extra credit of 30 points were given. Besides being a very tough grader, she cared about her students and their learning progress. She encouraged participation and also student interaction in the class. Study well then you will pass!",
            "She doesn't teach the material that is in the homework, or does simplified versions that are not helpful to learning the difficult material. She taught multiple concepts blatantly wrong. She gives rude responses to reasonable questions from students. Her lectures are ineffective at teaching the concepts and often focus on irrelevant material.",
            "No matter who you take 1. MGT 366 is a hard class 2. There's no easy A. Putting aside she makes you feel dumb, there are good things about her class. She gives a lot of extra credit, tells you exactly what math problems will be on the exam (crucial, some teachers dont) and gives you a \"help sheet\" on exams. She makes sure you know the material tho.",
            "DO NOT TAKE HER. She made her tests incredible hard and no one finished them on time. One time she even left the class with 10 people still taking the exam and we all had to chase her up to her office to hand it in. She gets distracted easily and lectures are her reading the powerpoint... which she goes too fast on so you cant even take notes on.",
            "I can honestly say she is one of the worst professors I've ever had. Her methods of teaching in class are sub par and do not prepare you for the overly packed exams she gives. She's very vague in her explanations and passive aggressive. Do not take her for any class. Also, be very thorough with everything that has to do with the plant tour.",
            "She is very nice at appearance, but is not very understanding with students. If you ask a question her response is always very passive aggressive. Homework you grade yourself, quizzes are online, so you really get nailed on exams and the plant tour project. Shes very critical of your plant tour charter, benchmark questions, and written report.",
            "Terrible Professor!!! I have had not problem in excelling in school throughout my years at GVSU, and she put a halt to that. I would advise anyone and everyone to never take her!!! The worst professor I have ever had!!!!",
            "Prof Levenburg was one of my favorite profs I've had at GV. She's quirky and funny, and explains everything we need to know in great detail. I was originally dreading this class but it ended up being my favorite of the semester. Also gives 30 points extra credit. Would highly recommend her and this class!!!"
        ]
    },
    {
        "id": 151,
        "first_name": "David",
        "last_name": "Good",
        "similar_professors": [
            "Dan Wiljanen",
            "Matt Bazen",
            ""
        ],
        "ratings": [
            "The best professor ever! If I would have a chance I will take him for all my classes. He is the only professor that take care of students. He always teach so clear and gives you a lot of explanations. I recommend to you all, Respect!!",
            "Dr. Good has a great personality and has 2 tests, 1 phone call, and 1 presentation. It is very manageable, and I recommend taking MKT 356 !",
            "Nice, funny guy. A bit odd but easy to listen to. He has some sales experience and know how to teach it, but its his way or the highway, and there are 100 ways to sell. Overall fun useful class. Recommend",
            "I had him for MKT 356 and 451... you learn a lot from his lectures but his tests are mainly based from the book, which is why they are so rough!!! Overall one of the best professors I've had @ GV!!!!",
            "Professor Good is a great teacher, in fact one of the best at GVSU. He is very laid back, but is willing to help with problems. He leaves assignments a little vague, so it makes class tough. He does this on purpose though to make you work, and it really helps you learn. Take this class, you will learn a lot.",
            "One of the best prof's at GV- I made sure to have him 2 more times next semester! very funny, interactive and keeps you attentive. Sales presentation isn't as bad as it seems, exams are not too bad (take online practice exams!)",
            "Dr. Good is a realy great proffessor. He really wants his students to do well in his class. Make sure you read the book and his powerpoints. The test weren't too difficult just make sure you read. Studying the powerpoints alone won't get you a good grade. Overall a great prof!",
            "Dr. Good is a great professor. He's hilarious, and always gives notes based on what you need to know, not every minute detail in chapters. The course requires a lot of individual studying for the exams, and the project is a BIG part of the grade, but overall the class was enjoyable and fun. DO NOT TAKE IF YOU CAN'T DO AN INDIVIDUAL PRESENTATION.",
            "This guy is one of the top professors at GVSU. Doesn't even need any aids to help him present the material. Great personality and fun guy to work with. He is demanding of students (don't miss any classes) but the landed benefit of having taken him for this capstone is well worth it!",
            "He is a great teacher, helpful, and very nice, always in a good mood and will make you laugh. His tests are pretty tricky so study, the sales call and presentation make sure you know your product well and youll do fine. Dont be afraid to close when he says sounds good, and if he says i have to think about it ask him what there is to think about."
        ]
    },
    {
        "id": 152,
        "first_name": "Pete",
        "last_name": "Brewer",
        "similar_professors": [
            "Elizabeth Killy",
            "Eric Marinich",
            ""
        ],
        "ratings": [
            "Not a very good instructor. Exams were curved anywhere from 8 to 10 percentage points just to get the exam average around a 78%. For a group of students to produce results around a 70% average just reflects how well the course was being taught. I would avoid him",
            "He is not the worst teacher, nor is his class the hardest. That being said it is a difficult class and he is a tough professor. Decent effort could get you a A or a C depending on the person. If you get below a C then you should major outside of business.",
            "Went to class everyday and put more work into his class than any other for the semester. Also studied a lot and still got a C.",
            "Good students can go to class everyday, put in a lot of effort, study and still not do well. Last semester was bad. Simply put, the class is very challenging. Brewer knows his stuff and is nice, but I would avoid if possible. He curves to reach a C grade distribution.",
            "Very difficult class, however Brewer taught the very simply. The problems he did every day showed up on the 3 tests. Come to class, take notes and go to to his office and you get a good grade",
            "Everyone was hatin on this dude but forreal ACC 222 wasn't that bad that semester. If you never went to an econ class and tried to learn everything 2 days before the exam you would've done terribly as well",
            "DO NOT TAKE BREWER!!!!!! I have no idea why there are so many smiley faces for this man. Basically my entire semester consisted of studying for accounting 202. His class was impossible. His tests are outrageously hard especially if you're not an accounting major. RUN FROM THIS MAN!",
            "Dr. Brewer was a horrible teacher. He just did practice problems in class. Exams were 100x more difficult than those problems. Had very low test average but did have a ~10% curve. Do not take this class with him!!!!! If anything, take it in the summer!",
            "the most important thing about this is class is to stay caught up with the material! do not try to learn everything a few days before the test. and try to stick it out until the end because the final really wasn't that bad.",
            "Dr. Brewer is a brilliant man. He can teach you a lot and he is nice. His class is very challenging and his exams are difficult. You have to pay attention and study a ton to do decent. As stated in a previous comment by another student, a huge number drop and/or struggle with his class."
        ]
    },
    {
        "id": 154,
        "first_name": "Peter",
        "last_name": "Salzarulo",
        "similar_professors": [
            "Elizabeth Killy",
            "Eric Marinich",
            ""
        ],
        "ratings": [
            "He is a nice guy, but changed his teaching style last semester different from other reviews. he does NOT do mini exams, just 3 real exams which were pretty difficult. He also cold calls and judges the quality of your answer to grade participation. NOT ideal for a WF class at 10:05 after a Thursday night. Decent guy but take someone else",
            "P. Salzarulo is a nice guy, but that's his only redeeming quality. This dude couldn't lecture to save his life. 90% of the class material must be taught to yourself. The class is still super easy, but don't expect much help from the prof. ADV Project is an insane amount of work that is worth just enough that if you don't do it, you will fail.",
            "Dr. Salzarulo is very caring and flexible! The class was not that difficult and he made sure that students understood the material. 100% recommend!",
            "Salzarulo may be one of the best instructors I've had in my academic career. MGT 302 normally isn't a difficult class, but Salzarulo makes it a total breeze. Mini exams each week over one chapter's worth of content. They make up 70% of your grade. 15% is participation and 15% is homework. You absolutely MUST show up to class each day to do well.",
            "Overall good professor. He has the class set up as each week you take a \"mini-exam\". This is a game-changer because it substitutes taking one big final exam. Just take good notes and read the chapters and you should be solid!",
            "Class is broken up into 10 or so mini-exams which, with a couple homework's, make up all of your grade. As long as you stay up to date for the mini exams, the class isn't too difficult. Salzarulo is funny and entertaining during lectures and uses a lot of real life examples which can help to understand some of the more boring course content.",
            "Amazing class, amazing professor. He does weekly \"mini-exams\" rather than your typical exams. This means you only have to study one chapter per week, and not stress about a huge exam. Lectures are great and he constantly uses real-world examples. Very caring and funny and does what he can for you to get an A. Highly recommend Professor Salzarulo.",
            "Good class, never less he could go a little bit deeper into the materia. But the fact, that he tells stories about the real professional live, gives you a good look regarding to your professional live.",
            "I. Love. Dr. Salzarulo. Lectures are straight to the point and he provides a lot of insight through (surprisingly interesting) real-world applications. He does mini-exams once a week over one chapter, which is so much easier to retain than through exams over many chapters. I loved this class and it inspired me to get a supply chain minor.",
            "Dr. Salzarulo is one of my most memorable profs during my four years. He taught with respect and thorough explanation of topics while not wasting time. I wished I was a supply chain major so I could learn more from him."
        ]
    },
    {
        "id": 157,
        "first_name": "Tami",
        "last_name": "Bailey",
        "similar_professors": [
            "David Austin",
            "David Yrueta",
            ""
        ],
        "ratings": [
            "She was probably the worst math teacher I have ever had but she is very nice and is willing to work with you if you missed a graded quiz or assignment. She genuinely wants her students to succeed but her teaching style is meh. She never fully answers questions and often gets confused while working out problems. Very nice but would not take again.",
            "she is a very nice lady but is terrible at teaching. She is not good at explaining the topics at all. she gives you the formula and expects you to be experts on it right afterward. She throws packets at you the first day the formula is given and expects you to fly through it. I have never seen a class as a whole being so utterly confused.",
            "I loved Professor Bailey so much. She wrote me a letter of recommendation! This class was genuinely so easy. There was only one unit I struggled with, but she cleared up most of the confusion I had. She never checks if homework is done, but I recommend doing it if a topic confuses you. There are quizzes every Friday, so make sure to study.",
            "Professor Bailey tries to help her students understand everything, but she is not the best explainer. There is quizzes every week so don't miss those. She is a tough grader, tests are worth a lot. She does not put in all the worksheets you do until the end of the semester so you will not know your grade going into the final until the very end.",
            "Not organized at all, basically writes the problem on the board and does not explain it, when someone asks a question she will partially attempt to answer but all students still end up confused. Don't miss the weekly quiz or multiple tests, no make ups. Be prepared to teach yourself this course.",
            "She doesn't teach anything, we are expected to already know everything. She just puts equations on the board without explaining how to do it or even what it is. Expect to earn everything by yourself.",
            "",
            "She is a very nice person but not the best teacher. My strongest subject is math and I struggled slightly in this class due to her teaching style. You can look up videos on YouTube or Khan Academy to help you, so if you have that kind of time, it's not too bad. Pop quizzes every Friday.",
            "Professor Bailey is extremely nice, but is not the best teacher. Pop quiz on most Fridays, but they weren't too difficult. She went much faster than any other professor I have which made the material confusing. This is the first algebra class I haven't gotten an A in.",
            "Prof Bailey does not know how to teach. We ask for help in class and she tells us she doesn't know and we should go to the math tutoring center instead. She grades test and quizzes very heavily and it's the only thing you're graded on. She assumes we know what she's doing on the board with no extra explanation. I do not recommend her as a prof."
        ]
    },
    {
        "id": 158,
        "first_name": "Roger",
        "last_name": "Ferguson",
        "similar_professors": [
            "Anthony Langley",
            "Denton Bobeldyk",
            ""
        ],
        "ratings": [
            "He retired after this semester, respect",
            "So cool",
            "Prof Ferguson is definitely a person I look up to. I had the best connection with him out of all of my professors I've had in the engineering course so far. He makes somewhat uninteresting topics lively and fun and is great at explaining tough concepts. Definitely attend office hours and introduce yourself. Good luck on your next adventure!",
            "CIS 163 was a blast with Ferguson. He made every lecture interesting and you could tell that he has had quite a lot of experience in the industry. If you are already passionate about learning programming, then this class will supercharge you! On the other hand, if you struggle with programming concepts, It will definitely be a challenge.",
            "First of all, Professor Ferguson is not a very organized person, so it is kind of a mess taking his class online, but he is a good teacher and I enjoyed his class. But at the same time, his projects are all pretty long and the final exam was unnecessarily long and hard. So my advice is that take his class in person.",
            "Ferguson is just all around a great guy. He is very honest in his feedback and WILL tell you his opinion, no sugar-coating. He is very helpful in office hours and will work with you until you understand the material. He is extremely smart and knows what he's talking about. Very good prof for CIS 163. Wish I could have him for future classes :(",
            "Dr. Ferguson's class was one of the best I have had. Even though I received a B, I can say that I had a lot of fun taking his class. He prioritizes Projects and Tests as these are pretty much your whole grade. If you do take his class expect to put in around 8-10 hours a week on projects. You will not regret taking his class!",
            "Dr. Ferguson is an amazing prof for CIS163. He really cares that students understand the material and gives a decent amount of help on the projects. This class is a ton of hard work but Ferguson makes it better and is somewhat understanding with grades. His lectures are easy to understand and engaging.",
            "He is very caring and he wants his students to succeed! You can go to his office for hours on end if you need help with a project or just want to talk. He will make sure you understand the content. The book is used in class to show examples! There are 4 projects, midterm and final. You HAVE to work hard to get a good grade but he will help you.",
            "Best professor you will ever have. Do what you can to get in this guys class!!"
        ]
    },
    {
        "id": 163,
        "first_name": "Terri",
        "last_name": "Bacon-Baguley",
        "similar_professors": [
            "Luke Peterson",
            "Adrian Copeland",
            ""
        ],
        "ratings": [
            "Shows favoritism. NO clear consistency in grading.",
            "This professor should be fired. She shows so much favoritism it's wrong. She's hung up on all the small details and was 5 weeks behind for path.",
            "Gret prof, she is helpful and a good person!",
            "Very hard but you learn so much!!",
            "Terry on the outside seems like a helpfull person, but do not trust her. She will stab you in the back faster than a NY minute. She is a power ****, and not a happy person.",
            "Best teacher ever!",
            "Smartest woman I've ever met, but treats you with great respect still",
            "No Comments",
            "No Comments"
        ]
    },
    {
        "id": 164,
        "first_name": "Brian",
        "last_name": "Curry",
        "similar_professors": [
            "Jarek Kozal",
            "Nancy Giardina",
            ""
        ],
        "ratings": [
            "Would take class again, best professor at GVSU",
            "funny guy; likes to talk about nipples (in a totally anatomical way, of course)",
            "Very serious..., always. Extremely intelligent, I think he knows every cell and its location in the body. Very organized.",
            "No Comments",
            "tests are damn hard even when you know the material. but makes lectures interesting.",
            "Very smart man, lectures are interesting. Don't ask him for any help because he won't give you any. Know EVERYTHING for the tests!!",
            "The class was harder than expected, but his lectures were always interesting. He is funny.",
            "Best Professor I've had at GVSU. His tests are easy if you know your information. Very intelligent man, and is willing to help if you ask for it. He will be missed greatly in anatomy land!!!",
            "Smart man. Knows what he is talking about. You need to study a lot to do good in the class.",
            "hard exams, but he can be fun"
        ]
    },
    {
        "id": 165,
        "first_name": "Tish",
        "last_name": "Fackler",
        "similar_professors": [
            "David Austin",
            "David Yrueta",
            ""
        ],
        "ratings": [
            "She went out of her way to embarrass students for dumb things like being late on the first day & going to the bathroom, myself included. Class atmosphere was uncomfortable. She is slow to post grades. I've never met such a two-faced professor. Glad she's retiring so I don't have to see her. I haven't disliked a teacher so much since middle school.",
            "When you aren't particularly gifted at math, a good teacher can make all the difference. Professor Fackler is not that teacher. Her tests were hard for a gen ed math credit & her personality is akin to professor Umbridge from Harry Potter. If you are great at math you'll be okay but don't take her if not. You will be belittled for asking questions.",
            "I loved Professor Fackler! Although she is retiring and will no longer be at Grand Valley she was still an amazing professor. Professor Fackler was incredibly clear and had answers for all questions. She really understood her students thinking process.",
            "Tish was awesome. I had her for 110 and 122. I hated math before her classes, but now I don't mind it at all. She is a tough grader, but that helps you in the long run. She's super funny and nice, and I am sad this is her last semester. Overall, I would recommend her to everyone if she was going to be here another semester. Thanks Tish! :)",
            "I saw her go out of her way a couple times to humiliate students. It seemed sort of weird and immature. Other than that, she's just okay--not great. I wouldn't take her again.",
            "ALWAYS show every bit of your work on quizzes or you won't get full credit. She's great if she likes you, but don't get on her bad side. Do the assigned homework and you will pass with ease.",
            "Prof Fackler was great! She would stop and clarify anything that you may have a question on and her office hours were always open to anyone who needed a little more help! I would recommend her to anyone who doesn't really understand Math!",
            "I hate math, but this class was honestly great. She's a great professor and truly cares how her students are doing. She makes the classroom atmosphere very comfortable and is super outgoing. Learning the material is super easy because of the way she teaches. Great professor.",
            "literally i only went to class for the tests. she treats everyone like they're in middle school and uses the book heavily. easiest class I've ever taken, so regardless of the prof you'll be fine. she drops your 4 lowest quiz grades and the final grade takes the place of your lowest test. nice lady.",
            "She offer's a lot of extra credit, but she does collect homework randomly and gives out pop quizzes. The test are pretty straight forward, but make sure you pay attention to her lecture because she moves fast!"
        ]
    },
    {
        "id": 166,
        "first_name": "Jane",
        "last_name": "Mays",
        "similar_professors": [
            "David Austin",
            "David Yrueta",
            ""
        ],
        "ratings": [
            "Professor Mays is a great mathematics professor to understand, her lectures are great and she offers a lot of help to any struggling students. Mays herself is very kind and caring. I highly suggest her for any mathematics class at GVSU.",
            "Prof Mays was one of the best profs I've ever had. Her classes can get boring, she cracks jokes and keeps it interesting. At the end of each class there's a \"quiz\", but you do it with your table and only turn in one. Her tests are easy and she tells you exactly what to study. There is homework after each class and she does collects it. TAKE HER!!",
            "Professor Mays made math very easy to understand, especially for someone that struggles! At the end of every class almost she gives \"quizzes\", but you can work on them with a group of people which helps your grade a lot. She is VERY specific about what will be on exams, including the final, which was SUPER helpful!! Highly recommend!",
            "Professor Mays is an ok teacher, nothing too special but nothing too awful. Her lectures are super boring - but it's math so you can't really blame her for that. She is straight-forward and honest about what's going to be on the exam. She has an in class assignment at the end of the majority of classes, which makes attendance mandatory.",
            "She is a GREAT professor, highly recommend to take her class. She explained the information really well and answers your questions. She gives out worksheets after every lecture to practice and then your table group has to turn one in for a grade. She cracks a couple of jokes once in a while so she kept us entertained. Highly recommend!!",
            "She was a really good professor, and always took time to work through problems if a student had a question. I would 100% recommend her to anyone. She did assign quite a bit of homework, but it was always relatively easy, and always easy participation points.",
            "She was a great teacher and went at a good pace. Her quizzes were basically group worksheets and she always gave you more than she counted, taking your highest scores.",
            "Such a good professor. She explained things very well in class and was always willing to explain more if people were confused. The homework is all out of the book and nothing online which is nice. Homework could take some time but she usually took some problems out of the assignments.",
            "Jane seemed nice and she was available to help in class but her style of teaching included really understanding the material beforehand. I am not good at math so this was a very difficult class for me so if you're not very good at math and need a little more explanation I would not recommend taking her class, if you understand math, you'll be fine",
            "She is a great professor who makes it easy to succeed in a difficult subject. She shows you different ways to do things including how to do almost everything on your calculator and gives formulas on tests."
        ]
    },
    {
        "id": 168,
        "first_name": "Paul",
        "last_name": "Jorgensen",
        "similar_professors": [
            "Anthony Langley",
            "Denton Bobeldyk",
            ""
        ],
        "ratings": [
            "Good guy, lots of experience. Sometimes drowns out innovative or critical material with personal stories that may or may not be politically correct, but very sharp and always willing to accommodate.",
            "Long story short, AVOID this professor at all costs. Lectures consists of him telling unrelated stories from the 70's and if you're lucky, very brief and vague explanations of class material. Forgets the answers to his questions sometimes. Somehow, I go a good grade thanks to his grading system but I learned NOTHING.",
            "I would never take this professor unless you absolutely have to. Lectures for 5 minutes, tells stories the rest of the time, and then when its time for the test he expects you to know every little detail and do a 2 hour test in 50 minutes.",
            "He spend most of the class telling stories barely related the the course description. It felt like he did not prepare for any classes. He was very disorganized and bad at using Blackboard.",
            "Very flexible about assignment due dates. Grading scale is generous. Had to do a lot of guessing on assignments and the midterm exam since they were extremely loosely based on the lectures. Very unclear when answering questions and assigning homework. Expect to do a lot of your own thinking. Deadlines were never stuck to.",
            "His class lectures were horribly boring, and he spent most of the time telling stories which were not relevant. I emailed the professor three times throughout the semester with questions and never received a response. His experience is 30+ years old. I've since completely changed my schedule to make sure I'll never take a class with him again.",
            "Very nice guy. His opinions are out there sometimes, but he's funny and he's nice. I wish we'd read more material relevant to Liberal Studies instead of just material relevant to his beliefs, but oh well. He cares a lot about his students.",
            "This guy is ridiculous. We are supposed to be learning how to apply our knowledge in the field of Computer Science and he's blabbing on about telephones. Completely useless professor that should have retired years ago. He often laughs at his 'non-jokes' and doesn't go anywhere with his lecture. I've already contacted the suicide hotline.",
            "Prof Jorgensen is a great professor. I have taken him before and he is a fair grader, very clear, and adds humor to the class. I have another graduate course with him in the Fall and I am looking forward to it.",
            "Well, I'm really not sure why he teaches lib or what the point of that course is...but I still got an A. Really nice guy, and super easy class."
        ]
    },
    {
        "id": 169,
        "first_name": "Steeve",
        "last_name": "Buckridge",
        "similar_professors": [
            "Carolyn Shapiro-Shapin",
            "Chad Lingwood",
            ""
        ],
        "ratings": [
            "I have had a lot of great professors here, Professor Buckridge is one of the few who isn't. He spends most classes talking about near meaningless things for the first 15-45 minutes of class and then speeds through the rest of the lecture because we don't have enough time. He also rejects student ideas. Have much more to say but dont have the space.",
            "He is an AWESOME prof. he's so nice and clearly very passionate about what he teaches. there are pop quizzes, but he hints very heavily a couple days leading up to them. the course is only grades by a few things (quizzes, one paper, midterm and final) but he is a pretty light grader. As long as you try in this class, you'll succeed",
            "Professor Buckridge is a very interesting and funny guy. I like him as a person, but as a professor, he is not my favorite. There aren't really any regular homework assignments, just a few mini essays and two big essays. The textbook for this class is very boring. He never put a single grade in BlackBoard, and isn't good at responding to emails.",
            "Professor Buckridge is very passionate about what he does. He ensures that students can understand his lectures and makes them interesting.",
            "This class is 4 modules, each with 3-4 discussion questions that need to be at least 2 paragraphs each. It requires a lot of reading and critical thinking, but you have a few weeks to complete each module. He is a pretty easy grader. DO NOT wait until the last minute to do the assignment, because they are very time consuming. Great prof though.",
            "Not only is he one of the best professors you will ever have, he is one of the best people you will ever meet. He is funny, insanely intelligent, and has so much life experience that he is willing to share. You will not regret taking his classes, in fact, youll regret it if you dont. He cares about his students and WANTS you to succeed!",
            "One of the best professors I have ever had at Gv so far! the class is very easy to follow I took him online and only had 4 assignments no quizzes or test, and even though history is boring sometimes he made the class very interesting with the way he teaches, I would take him for any subject if I could!",
            "Genuinely one of the most amazing people you will ever meet. His knowledge is so vast and his life experiences are incredible. He cares for his students and the subjects he teaches. His class may not be an easy A, but it is so insanely worth it. Take his class. Youll be so glad you did.",
            "Professor Buckridge is an amazing professor. I have absolutely no bad words to say about him or his teaching style. I would take this class again honestly, especially since I missed out on half of a semester with him due to Covid-19.",
            "Professor Buckridge was my favorite professor that Ive had. His lectures were engaging, he was funny, and I learned so much. You have to work for your grade, but an A is obtainable."
        ]
    },
    {
        "id": 170,
        "first_name": "Kathleen",
        "last_name": "Underwood",
        "similar_professors": [
            "Carolyn Shapiro-Shapin",
            "Chad Lingwood",
            ""
        ],
        "ratings": [
            "Pretty unorganized with syllabus, readings, and general daily lectures. We had a small class, so she definitely noticed if you didn't come or submit something on time. Tries to be helpful, but often made it more confusing. Lectures seemed to be catered to those who had more knowledge on the subject already. Very nice lady, but not a great teacher.",
            "Without a doubt the worst class I have taken at GV. She changes the syllabus several of times and is never sure of what to do. An absolutely ridiculous grader. More than several of the students did not pass the class. If you are scheduled to take her, GET OUT NOW.",
            "She is a great professor!! If you take the time to meet with her to discuss projects or other work, she will really do everything she can to help you. Very easy to talk to. A bit disorganized at times, but it really doesn't affect her teaching or the class really. She is very flexible and will change the syllabus to meet the needs of the class.",
            "Very disorganized. Very frustrating. She changed my grade on blackboard multiple times after already giving me points for assignments. Asked for assignments back that she graded so that she could re-enter my grades. She gets off subject a lot. Surprisingly she is getting an award for teaching...God help us.",
            "constantly changing what is mandatory for the assignments and what is good or bad for the assignment. On the same paper took off points for certain thing and later in paper wrote \"great\".",
            "Dr. Underwood is really a great professor. She is a little disorganized at times, but will do anything to help you. The class isn't hard but time consuming. She will work with you and is flexible pushing back due dates.",
            "She is so disorganized. Literally modified the syllabus 5-6 times throughout the year.",
            "disorganized, kind of mean. Didn't seem to care about individual students, and didn't let students fill out evaluations at the end of class.",
            "Knowledgable, but rather disorganized. Vague assignments that were graded very hard considering.",
            "Gave us the option of doing a journal instead of an essay! I loved it and it helped me get a better grade!"
        ]
    },
    {
        "id": 171,
        "first_name": "Corey",
        "last_name": "Anton",
        "similar_professors": [
            "Chad Velez Ortiz",
            "Issac Simon",
            ""
        ],
        "ratings": [
            "Professor Anton is so passionate about his job and is a genuinely great person. He makes his tougher-to-read material enjoyable and after a few stumbles, you learn the pace of the class. He cares that you do well, as long as you actually try.",
            "Genuinely a cool guy as a person and as a professor. Honestly was terrified seeing the course content at first, but he made it digestible and entertaining. Exams were open note + flexible with options for questions. He loves what he teaches and is clearly passionate. He is open to explaining any questions you may have.",
            "Prof Anton is an amazing professor. As a Com major, I thought this class was awesome. Content was interesting and relevant, reading quiz before every class, two tests throughout the semester, as well as a midterm and a final. Anton is passionate and provides examples and explanations upon request and is very open to all question. 100% reccomend!",
            "Corey is the type of guy that makes you want to be a great student. Hilarious, gives amazing examples, awesome lectures/explanations. Course is very reading-heavy but Corey makes it fun. I cannot stress enough how much I have learned from him. I would love to take another one of his classes in the future. Highly recommend!!!!",
            "Prof. Anton will most likely talk the entire class period, which in other classes is annoying or boring but he makes the lecture entertaining and interesting. I would recommend Anton for any COM class, my favorite professor I have had for any level communications class!",
            "Corey honestly slays. At its core, the class is pretty boring but Corey makes it actually so interesting if you really take in what he's saying. He is pretty funny and likes to joke around. He also likes to juggle so if you want extra credit make sure you can juggle. Reading quiz before every class out of 1 point which is pretty odd but so easy.",
            "This class was on the easier side of classes however every week you had 2 quizzes based on the readings for each week. 5 questions worth 1 point, not many points in the class. Two explications about two readings you sign up for and one final paper that's 6 pages. Very clear criteria and lectures are heavy and based on the readings.",
            "Every class period has a reading and quiz that go along with it. Not too difficult once you get the hang of it. Just focus in class and you will do well. He also never gives 100% on any written work so do not expect it. Nice guy and makes lecture interesting. I scheduled a third class with him because I enjoy them very much.",
            "Professor Anton is highly passionate and tends to keep class interesting. The course structure is pretty repetitive, but the course load is manageable and the conversations in class were interesting. Definitely a qualified professor for the subject, I would highly recommend Anton.",
            "Prof Anton is fine. Nice guy and passionate about what he teaches That said class is repetitive, quiz due before every class, students explicate the reading. If you have to take this class, communication theory is only so exciting. Class curriculum feels so draining and it's the same every single time. Super hard to stay motivated and go to class."
        ]
    },
    {
        "id": 174,
        "first_name": "Janel",
        "last_name": "Zeman",
        "similar_professors": [
            "Alexandra Locher",
            "Benjamin Gunnett",
            ""
        ],
        "ratings": [
            "Professor Zeman is passionate and engaging, but the material is challenging. Attend class, study diligently, and utilize tools like Quizlet and unstuckstudy ai to succeed. With effort, you can master the content and earn a solid grade.",
            "She was pretty good and was very is very passionate about biology! Sometimes the lectures got fairly boring, but once a week we would do activities in class. She's tough but good",
            "Good professor but go to classes when you can because she does in-class assignments that are graded and honestly are helpful.She is very interesting in her lectures and willing to help and basically give you the answers on in-class assignments so never be afraid to ask for her help. Quizlet's online for mastering answers.",
            "Zeman is a great professor; you can tell she knows what she's talking about and tries to give as many examples as possible. Unfortunately, the material she teaches is challenging, so even with all her guidance, the class is pretty demanding. If you skip, you will really struggle. Study time and notes will make or break your grade.",
            "Professor Zeman is very passionate about biology however, I found myself getting frustrated with the amount of homework each week. She can be a pretty tough grader (especially for lab reports) and isn't always the most clear with instruction or what she expects from students. She is also very stringent about the attendance policy and missing class.",
            "If you are someone who struggles in science and needs to take this class as a requirement, Professor Zeman is who you want. If you show up to class you can earn points through group activities, and the majority of exams are taken outside of class online which is unheard of. Also, getting tutoring once or twice a week is a huge help too.",
            "She is an overall good professor and knows what she is teaching. If you do not pay attention you will not pass. You cannot slack off here",
            "I overall really liked her. She explains things well and kinda leaves you to do things with your group and checks up on you every now and then. She does pick favorites though and if you aren't one of her favorites good luck. You do have to do prelabs which are lengthy but she makes it clear what she is grading.",
            "Janel is super caring about students and if you go to class she will be extra willing to help! Did not pay attention to any of the mastering (thanks google) and was fine. Study the slides and you'll be fine!",
            "The majority of your grade was based off the exams taken after few chapters. All information was expected to be learned just through all her powerpoints. We had participation activities, but most of the time they didn't help with understanding. She just talked off the slides. I had to get a tutor to help but even with that the exams were brutal."
        ]
    },
    {
        "id": 175,
        "first_name": "Edward",
        "last_name": "Aboufadel",
        "similar_professors": [
            "David Austin",
            "David Yrueta",
            ""
        ],
        "ratings": [
            "Great professor. Knows how to derive pretty much every equation used and he shows you in class so you really understand what is going on. He is very helpful outside of the classroom a really great guy. If you get him in the fall you will get a surprise on halloween. Projectslabs are awesome. Take this guy.",
            "Great professor, goes over all topics thoroughly and is always in his office if you need extra help",
            "Professor Aboufadel does a great job going in-depth on all topics covered. He gives time every class to check the ungraded homework from the previous class, and will walk the class through a few problems before starting his next lecture, which is basically just a series of new problems to walk you through.",
            "gets upset real easy, sometimes avoids answering questions, not sure whether he knows what he is teaching.",
            "Basic Calc 1 class. Some of this teaching methods are a little childish, but he does know what he is talking about. The homework in class is not mandatory, but you will have a hard time keeping up in class if you do not do it. The projects for this class are very minimal as well.",
            "He's Grand Valleys Math Board of Directors so he is really strict and by the books. I was doing alright until the final exam, which was a bunch of things he crammed into the end. A lot of group work. Don't recommend.",
            "Good teacher with a weird sense of humor. Very clear; sometimes he goes too fast, but just ask questions and he'll slow down and re-explain. MUST go to class because he collects \"homework tickets\" and gives small quizzes virtually every day. They aren't very many points, but they add up very quickly.",
            "Great teacher. even if you're not very good at math, he's a good teacher to take this class with. He explains things better than any other math teacher I've ever had, and is always willing to give you extra help. do the homework even though it's not required and go to class and you should do fine",
            "He's a really nice person, and is really smart, but his class was really difficult for me. There was a fair amount of homework and a quiz every week, just make sure you do the homework! The quiz points add up fast, so start off right. His final exam was impossible though.",
            "The class wasn't bad if you actually put the work into it. The proof portfolio turns out to be pretty easy if you start it right away and turn in your drafts. You do have to go to class though because the book does not explain things well and he does a pretty good job and gives lots of examples."
        ]
    },
    {
        "id": 176,
        "first_name": "Patricia",
        "last_name": "Matthews",
        "similar_professors": [
            "Alexandra Locher",
            "Benjamin Gunnett",
            ""
        ],
        "ratings": [
            "Absolute worst prof I've had. Attending lectures and feeling good about the material, isn't enough. Tests are too specific and have odd wording. She has the weirdest grading scale ever so you never know your grade which is probably awful because of the way her tests are. I dropped having a F - retook it with another prof and easily got an A.",
            "This is the most frustrating class I've ever taken. I've attended every class and take notes but she puts problems on the tests and homework that she's never showed us how to do. Most of her quizzes and homework are completely fill in the blank and she looks for very specific answers and has vague wording so you don't know what she's looking for.",
            "Worst professor I have ever had. I am very surprised she is still able to teach at GVSU. She was very disrespectful to me when I emailed her with questions about my quiz. She never answers questions about homework. She complains that people don't pass her quizzes literally saying it was disturbing in a blackboard announcement.",
            "I don't have one good thing to say about Prof. Matt. She ruined genetics for me as it was one of my favorite topics until I met her. Her homework and quizzes are nearly impossible to answer as she is very specific, will only accept her version, and won't ever give partial points. They are ALWAYS over things we never discussed.",
            "The worst professor I have ever had. Exams were extremely difficult and covered things we did not learn. I loved and understood genetics but still struggled in her class. When asking what I could do differently I was told I could start by learning the English language. Never went over examples so we never knew where we were going wrong! Avoid!!!",
            "Don't take this class, she will get you in the position to get a grade W, she has some set of protocols she wants all the answers as per her requirements. Not recommended.",
            "Worst professor I've ever had in my life. She was condescending and rude in emails. Exams and quizzes were mostly fill in the blank and she wanted VERY specific answers. The questions on the exams were things she never taught and couldn't be found in the book. AVOID HER.",
            "Her exams and quizzes are open book, open note, open internet. She is very accessible and flexible outside of class and is more than willing to help. She drops your lowest grade at the end of the semester. Exams are just tricky due to specific wording. Put in moderate effort and you will pass no problem.",
            "Professor Matthews is unwilling to help students when asking questions. Multiple times throughout the semester she told me she couldn't answer my question because it would not be fair to the class. She is very condescending in emails and expects very specific answers on homework and quizzes. She also takes points off for minor things.",
            "AVOID. The lectures were not interesting, and you can barely take notes. On tests and quizzes expect to see a lot of material you've never learned. Also, she'll accuse your whole class of cheating and take it to the board. She is also very condescending when you are trying to get help from her. DO NOT TAKE HER."
        ]
    },
    {
        "id": 177,
        "first_name": "Donald",
        "last_name": "Paszek",
        "similar_professors": [
            "Amanda Karsten",
            "Brian Bowdle",
            ""
        ],
        "ratings": [
            "Five non-cumulative exams and one paper where you study an adolescent. The lectures alone are just him and his monotone voice talking the entire time, no slides or anything remotely useful, but you are required to take notes. Any info on the exams comes solely from the textbook.",
            "Paszek is genuinely a good professor if you love lectures. Make sure you take extremely good notes and READ THE TEXTBOOK. You need to know terms and put those terms into context for tests. There is one big paper at the end of the term and an EC with it so do both, start early. Use Vital Source for the textbook to save $ and is helpful for the paper",
            "The information in this class was really interesting and he was a really nice professor. I thought the lectures were interesting but he would only cover a very small amount of the material that we needed to know and he writes very little on the board so it was challenging for me to take good notes. Reading the book is necessary and lengthy!",
            "I really enjoyed this class! There are exams every two weeks, which seems like a lot but each are over only two chapters. They are easy to study for, especially when you do the chapter readings. There were 5 papers throughout the semester but they didn't have a length requirement and were very straightforward. Highly recommend Prof. Paszek!",
            "Do not take Paszek for PSY364 unless you can stand to sit through super boring lectures. He lectures out of the book and writes maybe 5 words on the board all of class so you have to be listening to what he says. Also the exams are pretty hard and does not even cover what he lectures. Also can be pretty rude.",
            "He only grades on six things, five exams (non-cumulative) and one paper. The paper is easy you just have to study a child. The only bad part of his class was the informal notes. He doesn't do slides or anything he just writes on the board. Just write down everything he says and study your notes you should do good.",
            "I didn't think I'd do well with Paszek but his class was actually really easy. He is monotone but everything that he says shows up on the tests so take good notes. You really can't miss a class if you want to do well because of how lecture heavy the class is. Overall, Paszek is a great guy and a solid choice for a prof!",
            "I loved Professor Paszek, he's really funny and gives good lectures. He's monotone but he throws in jokes a lot, so it's not as bad as people make it out to seem. You need to read the book, 80% of the exams are based on lecture, 20% from the book (for a few exams I just did the book vocab and would get high B's). No final, 1 paper which is easy",
            "Prof. Paszek is super funny and is SO nice if you go to his office hours! The tests are pretty hard and you absolutely HAVE to read out of the book or you will not pass the exams. He can be monotone, but he adds in humor at times.",
            "Nice professor, but very monotone. Going to class is mainly a waste of time, but he would sometimes play a video and have questions about it on the exams. He doesn't do PowerPoints, so you need to pay attention if you want to take notes. I recommend focusing on your textbook if you want to pass."
        ]
    },
    {
        "id": 178,
        "first_name": "Jim",
        "last_name": "Ledrick",
        "similar_professors": [
            "Dawn Richiert",
            "Elizabeth Aschwege",
            ""
        ],
        "ratings": [
            "Amazing guy, whole grade is based on 4 tests, just study and youll be fine .",
            "Jim is such a great prof. Easiest class of my life, never used the textbook although he says you will. All of the notes are in a powerpoint on black board. His lectures can be pretty dull, but Jim really makes the class. I'd highly recommend him for BMS100.",
            "I found the class to be really laid back, and the subjects we disscussed were very interesting. But there are only 4 exams, and attendence counts toward your grade. If you aren't a good test taker like me, I wouldn't recommend this course. The teacher is kind of funny and really chill, but I never felt like I could come to him with any questions.",
            "YOU NEVER HAVE HOMEWORK! easy gen ed as long as you study for the tests; there are only 4. you never use your book just make sure you go to class and take good notes. he does attendance through one min papers which really give your grade a boost. i would def recommend taking prof ledrick",
            "This prof is very friendly and easy to talk to. He is helpful with any questions you have and good at responding to emails. He knows his material very very well and makes the class fun. I had it at 9:00 am and enjoyed going. You don't use your book often and there are pop quiz type things called one min papers.",
            "good professor. The book is not needed as the exams are over the lectures. The final grade is a combination of 4 exams and attendance, so go to class. If you're looking to knock out a gen-ed I would suggest him.",
            "He keeps class interesting for the most part. He makes the material really easy to understand. he keeps the class pretty light, with pretty much no homework other than studying for the exams. Sometimes exams had material that wasn't on the study guide, so be prepared for that. I would HIGHLY recommend this class, useful material and great prof!",
            "This is a great course for non science majors. Extremely interesting lectures to people who are interested in health on a surface/lifestyle level. Reading is unnecessary -- don't spend money on the book. Print out notes and study guides from blackboard. Go to every class, take notes, and pay attention. Easy A.",
            "Kind of a boring class, but the professor is awesome. Such a cool guy and makes the material fun to learn. Recommend this class.",
            "Professor is great. The whole class is structured around 4 tests that make up your overall grade. I think this is a very poor way to structure a class, but if you are just looking for a class to fulfill the stupid gen ed requirements then this is probably a good choice."
        ]
    },
    {
        "id": 182,
        "first_name": "Frank",
        "last_name": "Griggs",
        "similar_professors": [
            "Dan Wiljanen",
            "Matt Bazen",
            ""
        ],
        "ratings": [
            "Griggs does not take his job as a professor seriously. It's all just a joke to him, he does not seem to care that much for his students. That being said, this guy is completely HILARIOUS. I was never bored during class. His lectures could be followed but were never really clear. Tests were ridiculous too with enormous curves. I think he is retiring",
            "I think he's retiring but I wish he wouldn't. Homework is minimal, quizzes are 5 questions and you can take them as many times as you want to get full credit. His tests can be kind of tricky but if you're in class and you study the quizzes you'll do just fine. Very knowledgeable and adds humor to his lectures to keep you interested. Great guy.",
            "If you do everything that he tells you to do on the first day you will be successful in his class. His teaching style IS effective IF you are willing to put in some outside work. He is very clear on what he wants. Great guy who is always willing to help out his students. Will definitely take one of his classes again.",
            "Recently started teaching 322 and he has no idea what he is doing. Knows his stuff, but doesn't convey the information well to the students. You will end up doing well in the class, but you won't learn a thing and will struggle in 422.",
            "His teaching style is not effective. Half the exam question are material he does not cover and are very tricky! Many people dropped and many people failed. Its pretty easy to get a B with effort but an A is very hard!I do not recommend him. (He is very nice though)",
            "Watch out for his tricky exams, practice the problems in the book and show up for class and you'll be fine. A fair warning though, Griggs is a fan of kilts...",
            "I really enjoyed Griggs. His teaching style is effective and he is more than willing to help you out when you're stuck. He truly cares about you succeeding. Do the suggested problems - He takes nearly half of the exam questions from them. Overall a good professor - I would take him again.",
            "I'm going to put this very simple, ineffective teacher. I am now taking the class over with another professor and it is amazing how much easier the class is to learn now.",
            "Exams are a bit hard but I really enjoyed him and this class.",
            "HARD. very confusing. Very nice guy but the class itself is a pain to get through. No structure. Does not teach the theory but tests heavily on it."
        ]
    },
    {
        "id": 183,
        "first_name": "Maria",
        "last_name": "Landon",
        "similar_professors": [
            "Jacob Haseley",
            "Jerry DiTrapani",
            ""
        ],
        "ratings": [
            "I switched my major to marketing because Maria made the class that awesome. I wish I could have her teach all of my classes. You can tell she's really passionate about her students and she really wants everyone to learn. Take her!!",
            "I am not a marketing major and only took this class for my HTM program. Maria made it so easy! Attend her classes and go to her for questions and this class will be a breeze! LOVE her!",
            "I absolutely loved taking her class. By far my favorite professor at Grand Valley. She is super knowledgable and gives you great advice about things outside of the classroom like how to approach interviews and her past experiences. TAKE THIS CLASS! You will also be laughing a lot she is so funny.",
            "Love Prof Landon and highly recommend her! Her lectures are fun and engaging. Take her for SWS, assignments are bullet form and she gives you the answers. Tests are tough, read book definitions to help you on them. Other than that the class is pretty easy. She'll give you lots of advise to succeed in life, not just the classroom.",
            "She's hilarious. Make sure to interact with her and smile!! She is the easiest prof for SWS classes because we didn't write any papers. There were six projects that were super easy to complete if you follow the directions. Tests weren't that bad either. I would take her again.",
            "Professor Landon is AMAZING! Her passion for students and marketing is very evident. She truly cares about her students and wants them to do well. She teaches clearly and tells you exactly what is on the tests. The assignments through the semester are super easy as well. TAKE HER if you get the opportunity!!!",
            "Landon is very passionate about marketing, the project is spoon fed to you all semester, but she is a tough grader, you will work for the grade, sadly I worked harder in this class than any of my Acc and MGT classes and still ended with a B. Test are hard because she does not prep you for them and a lot of T/F. But super nice to get to know!",
            "A great professor! I have just taken her for MKT 350! Make sure you stay out of your phone and take notes. Be participative! She engages the class into her lectures. If you take good notes you won't need the book.",
            "Maria is a great professor! I do not like marketing nor am I majoring in it. She tries to get the class engaged (even though most students do not for some reason). I would take her class again! She is very helpful and will do whatever it takes to help you.",
            "Maria is a very outgoing teacher and will definitely make the class worth while. Her assignments are pretty unclear, and require a good amount of time to complete. As long as you show up, take notes, and make study guides for the test, you should be fine."
        ]
    },
    {
        "id": 184,
        "first_name": "John",
        "last_name": "Hodge",
        "similar_professors": [
            "Ben Walsh",
            "Bruce Ballard",
            ""
        ],
        "ratings": [
            "Confusing, gave us his own definitions ( which you have to write exactly what he says on exams to get credit) and half the time is wrong with what everyone else the concept is. Also will not answer your questions and will interupt you when you are asking a question",
            "NOPE. Do yourself a big ol' favorite and get out of his class while you can. Even though he's relatively easy, dealing with him every week isn't worth it. He is incredibly passive aggressive and argues with students if they don't agree with something or asks a question. Buying the book is also useless because he only teaches his opinion anyways.",
            "This class with John Hodge is so unbearable. I honestly thing this is the worst class I have taken in my time at Grand Valley. I don't think I learned anything at all except for random ideas that popped into his head.",
            "If you wish to learn the subject of Management then do no take this course with Professor Hodge. It's a painful class to sit through and all he does is bash the book and the author. You will learn Professor Hodge's version of Management and nothing else. However as long as you attend class and write down what he says you should get an easy A.",
            "Professor Hodge was the most confusing I have ever had. He would go over the book just to tell us it was all wrong. If you don't write word for word what he lectured in class on the exams, he will mark it down. Has many sayings he repeats over and over again like \"Come on guys\", \"Do you hear what I'm saying\"",
            "The 331 6-9 never went the full time, all the grade comes down to is, three exams and one 12 page paper, wants to help students however can become very annoying with his repetitive statements and confusing lecturing.",
            "Hodge is a very interesting man. He is kind of funny but his lectures are boring. He is very specific about what he wants for your test which is nice but when it came to my SWS paper it had to be exactly how he wanted it which was frustrating. If you don't care about actually learning, then take him.",
            "This is my fifth year at GVSU and I am disappointed with John. If you want to learn management take someone else. John teaches it with his opinion and not what the book says. He grades harshly on the research paper. I visited his office hours, did what he told me to do, and still got a B- on the first attempt. You can redo paper for a second grade.",
            "Prof. Hodge is difficult to explain. If you are content with learning nothing about management, but would like a GPA boost, I recommend him. If you aren't one for sitting in class watching him recite his opinion on the textbook terms day after day after day, another professor might suit you better. I took this class for the near-free A.",
            "Not the most enjoyable can become annoying put he gets his point across and you do learn. His test are easy he tells you exactly what to write down( exactly what he says in class not what is in the book!)"
        ]
    },
    {
        "id": 185,
        "first_name": "John",
        "last_name": "Golden",
        "similar_professors": [
            "David Austin",
            "David Yrueta",
            ""
        ],
        "ratings": [
            "Can't say enough good things! The \"textbook\" is book club style and really developed my teaching pedagogy. Genuine guy who really cares for his students. Class consists of a journal that you maintain all semester long. Not too much work. Learned more about teaching in this class than any other class I've taken! He's awesome!!",
            "I loved this class. It really taught me a lot about the education field. We spent classes leading discussions, class activities, and leading/teaching our own lessons. I highly suggest taking this class with John!",
            "It was tough to know what grade I had at any given point because nothing is on blackboard but otherwise his class was very easy and content light.",
            "Litterly the easiest class I have ever taken in my life. There are no tests or quizzes in class, they are all take home and after you submit them you can revise them to get the grade you want. He is a very caring, nice prof and you can even get credit for assignments by going to office hours. Such an easy class, definitely take him!!",
            "I saw someone rated prof Golden back in October 2021 and gave him a 1. I want to say I took the same class that semester and he was terrific. I personally didn't like the class format (mostly discussion mixed with group activities), but prof himself was very helpful and caring. I learned a lot in that class. The class expectation is very clear.",
            "John is a really nice guy, but the class is slightly unorganized. Don't really need to do much to pass the class, but the class was usually boring (mainly because the class is about the history of math).",
            "Dr. Golden was one of my least favorite professors that I have had at Grand Valley. I did not learn a single thing in this course. He never posts grades throughout the semester and he is often unclear about his expectations. However, I will say that he did a good job in establishing a feel good student learning environment.",
            "Professor Golden was one of the best professors I've ever had at GVSU. He answered every question I had and he was very reasonable about the work he assigned. There were no tests or exams just some questions that we had to answer on our own time that he graded and we were able to revise as many times as we needed to get the A. TAKE HIM if you can",
            "Professor Golden is a very genuine guy. I learned a lot in this class due to the one-on-one teaching with younger students. However, the course work was a LOT in this class. Way too much homework in my opinion. The organization is also a bit hard to grasp because all of our assignments are in one google doc. He also doesn't put grades in BB at all.",
            "While he's a nice guy his class is way too much work for the lack of instruction and clear guidelines. He uses one google doc instead of blackboard which is annoying because you have to constantly check that doc. No grade book so you don't know what you get until the class is done. Expect tons of busy work and too many hours spent on assignments."
        ]
    },
    {
        "id": 186,
        "first_name": "Steve",
        "last_name": "Matchett",
        "similar_professors": [
            "Jarek Kozal",
            "Nancy Giardina",
            ""
        ],
        "ratings": [
            "Didnt love him at all",
            "Hes a good teacher. His homework and readings were the death of me literally took SO much of my time. The tests are very difficult. You MUST go to the lecture to pass. Hes not a dumb professor so dont try and make excuses. Not very lenient at all he has clear expectations.",
            "Matchett wasnt an awful prof, but he wasnt good. Chemistry has always come somewhat easy for me, but the way he taught it in lecture was confusing and made it difficult. He also has a temper and had yelled at my class numerous times through the semester and can be rude over email. If you can, I would switch profs if you get him.",
            "Matchett obviously knows his material, but in class I found the way he explained it quite confusing- his office hours helped! The readings were confusing/not helpful. Being in pre-vet, I have to juggle other tough classes, but the amount of work homework he gave us was ridiculous. It did not let me accurately utilize time for those other classes.",
            "Chemistry is super hard for me personally. Prof Matchett clearly cares about chemistry and his students. He emphasized how much he wanted to help you in any way possible. I took this course during remote learning and struggled but I dont believe it to be his fault, it was my own. He tries hard to make chemistry interesting for everyone.",
            "Before every class there is a reading homework which would prepare you for lecture. Then you would have 2 homework assignments on webassign due on Wednesday. This class was super hard. My advice is to not use chegg. It might help for the homework but the homework isnt worth enough to out weigh the test. Ask him for help, he will go out of his way.",
            "Solid prof, but a hard class. There was a few hw sets per week usually. Prof Matchett had good lectures. Hes always willing to answer questions and clear up any confusion. Going to his office hours really helped. He cares and wants ppl to succeed. His tests were hard, but not as bad as the final.",
            "Very encouraging and passionate. Even though it was hard, he really wants his students to learn a lot and I do think it'll benefit be me a lot in the future. I studied lots, did homework all the time, focused, went to chem success center one day a week and met with mr. matchett another day of the week and I barely got a C. Great prof, hard class",
            "Matchett is an awesome guy. I had him for lab, and his explanations at the beginning of the class were the reason I understood what was happening in my lecture. He always answers questions in a way you can understand. I wish that I would've had him in lecture.",
            "His tests are tough but he teaches the material well, im taking him again next semester for chm 116."
        ]
    },
    {
        "id": 187,
        "first_name": "Star",
        "last_name": "Swift",
        "similar_professors": [
            "Jim Sanford",
            "Mark Richards",
            ""
        ],
        "ratings": [
            "Star is nice but her class is hard. She doesnt really lecture and class is solely based on other students presenting the information to the class. It is all memorization and there is no book or formal notes to reference after class. the whole class is out of 100 points and it is very difficult",
            "Professor Swift was very knowledgeable about the law and was also very funny. However, she makes you work for your grade. There were several case readings and questions each week and your were only graded on 3 quizzes, 3 tests, and one presentation. It seemed to be taught more as a general law class than business related.",
            "Professor Swift is an amazing professor. She is very caring in addition to being extremely knowledgeable when it comes to the law. She has a great sense of humor and makes the lectures very entertaining. Due to this being a hybrid course, there is a lot of reading assigned for outside of class, which you will be asked questions about.",
            "Swift integrates technology into her classes more than most professors. So be open to learning the law and new tech. Brilliant and funny. I will take her again if I can get into her class.",
            "Swift is one of the best profs I have had so far. The amount of knowledge I have learned in this class is incredible & is also very applicable to the real world. I took the class as a hybrid so we met once a week. Lots of cases to read which will be on pop quizzes, also likes to call on random people so be prepared to answer questions on cases.",
            "I took Swift's hybrid class, and it was one of my favorites. She may seem intimidating at first, but Swift is an awesome professor who knows what she's teaching. Don't procrastinate the work until before class, and if you don't know the material, don't try to pretend you do. I learned so much from her that I'll be able to apply to my career.",
            "She grades you on quizzes, a presentation, and exams. You have to keep up with the reading and you will do OK. At first, I just skimmed the reading and learned the hard way, from my quiz score, to read the stuff carefully. I am going to med school but I wish I took this class earlier. Everybody should know this stuff for their work life.",
            "We arbitrated case in front of a real arbitrator. Swift walks you through each step but she is not happy if you do not read and watch videos. The workload is not crazy but if you have a bad team be ready to do a lot of work on your own. Liked Swift. Totally applied class.",
            "Hybrid class so we met once per week. She uses a thing called Bluescape so you can see videos, notes, other stuff all on a virtual wall. She is good about giving class very recent cases. You have to do the work or it shows in your grade but the work is not too much. Thing I learned is half the class time does not mean half the work.",
            "Despite the difficulty of the BUS201 class, Star Swift is my absolute favorite professor. She's reasonable, helpful, and one of the funniest people I've met. Her lectures include examples from her personal experience, and they make understanding the material much easier."
        ]
    },
    {
        "id": 188,
        "first_name": "Robert",
        "last_name": "Hendersen",
        "similar_professors": [
            "Amanda Karsten",
            "Brian Bowdle",
            ""
        ],
        "ratings": [
            "This class was way to hard for a Gen Ed. I would not recommend taking it. I had to for my major and I might have to retake it.",
            "He talks extremely fast in lectures so its hard to get all of the information. Also, I never understand his explanations. Exams are so hard because almost all of them are story problems. I usually get good grades in all classes and find it nearly impossible to do so in his class. Very difficult and stressful for a gen ed class. Dont recommend.",
            "He is a very helpful professor if you email or meet with him about questions that you have you'll be fine. tests have examples that are in the book or similar to ones he says in lecture. PSY 101 is a tough class with any prof you just have to do the work.",
            "He is a great professor, as long as you read the book and take good notes you will be just fine. Tests are easy and follows the outline to a tee. Great prof!!!",
            "Hard class! Hes very smart, but his exams are more in depth that what he teaches in class.",
            "REALLY NICE GUY BUT IF YOU WANT A GOOD GRADE DONT TAKE HIM FOR A GEN ED!!! SAVE YOURSELF AND CHOOSE A DIFFERENT PROF FOR PSY 101!!!!",
            "If you want a good grade with this prof, pay attention and take notes during lecture. Although the tests are difficult, he has a different grading scale than others to get an A. When it comes down to it, work hard for the grade you want. He also doesn't put grades on BB so you don't know until the semester is over. Work hard on final!!",
            "If you can get out of his class I would. The class is based off of 3 exams and thats it. The tests are very hard and the questions are not straight forward. There are no notes or handouts for this class everything is based on his lecture. Most of the information needs to be looked up online after class and that information isn't always accurate.",
            "Your grade strictly depends on how you do on the exam. He provides no notes, no powerpoints. Only provides a five page outline and does not explain the concepts. The exams were very hard even if you some how got all the information down for the concepts. Do not take this gen ed from this professor.",
            "Hes a great professor and is really good at explaining the material but the lectures were always long and in order to pass the exams you had to pay attention to everything. Your grade depends only on 3 exams and other mandatory activities. Theres never any homework just reading that is necessary to do well in the course."
        ]
    },
    {
        "id": 189,
        "first_name": "Richard",
        "last_name": "Pilgram",
        "similar_professors": [
            "Zachary Braiterman",
            "James Watts"
        ],
        "ratings": [
            "trash, trash trash",
            "He actually knows a lot about the topic, if you are willing enough to listen to what he's saying it is actually very interesting. He can be confusing because he's old, but he's actually a decent professor if you listen and try to understand.",
            "Actually miserable. Guy rambles on about god knows what (no religion pun intended), and then expects you to write a paper or take short answer tests and elaborate on extremely vague concepts. Just about everyone in the class is clueless about his expectations. If you're looking for an easy elective and figure this is a good choice think again.",
            "He likes to mumble",
            "i liked the class. as long as you read all the material and keep up with the concepts you should be fine. he can be boring at times when he gets wrapped up in something but for the most part its a good class. sometimes he drifts away from the ideas of the book we're reading and then it gets confusing but otherwise its easy.",
            "note: I was in the honors section. He was still horrible. Lecture was a snooze, and a waste. Just give an overview on religion and how they differ. Not in touch with his audience.",
            "Tests can be confusing so watch out. But he's a nice guy and a decent prof.",
            "The WORST handwriting ever. Where does the test material come from because it is very obscure.",
            "No Comments",
            "not that hard of a class, little boring, but not bad"
        ]
    },
    {
        "id": 193,
        "first_name": "Samir",
        "last_name": "Ishak",
        "similar_professors": [
            "Dan Wiljanen",
            "Matt Bazen",
            ""
        ],
        "ratings": [
            "Sammy is a prime example of how it's better to be feared than to be loved. At the start of the semester, he clearly laid out his expectations and grade requirements (which were very high), but he was not unfair or unwilling to talk one on one. You were required to participate in class and read a chapter every week. Very hard, but I learned a lot.",
            "A nice guy, but a TERRIBLE professor. Assigns more assignments than I can count, and tests are EXTREMELY long. Grading criteria is hard to get used to and very specific, but not terrible. He expects almost memorization of the chapter, and his workload is unbelievably high. He does not 'lecture' on material, only answers questions. Do not take him.",
            "If you know how to read a textbook and study, you can pass Ishak's class. Assignments and papers are easy enough if you put the time in. But here's a bit of advice: RUN FAR AND RUN FAST. Do not take this professor. He is one of the most awful people I've ever met, let alone the worst professor.",
            "Professor is extremely arrogant and rude to all students. Comes off very pretentious and talks down to students. Also has made inappropriate statements during lectures. All being said, if you stick it out and get all the assignments up and stay up on the material, you will learn a lot and the class will be rewarding.",
            "Taking his class right now. worst professor at GVSU so far. His assignments take 5 hours to complete but only worth 6 points. he is rude demanding arrogant and obnoxious. he will not listen to anything and if you ask a question you wont get a straight answer. avoid at all cost.",
            "Very hard prof, this class was a monster however i stuck it out and found it to be very rewarding. you learn a lot! lots of reading and memorizing chapters for exams but once you figure it out its not so bad. The prof and his assignments were very demanding. Theres no b.s. in the class, and it was very challenging but im glad i took it",
            "This professor is just amazing. Lots of people don't like this classe because it is exigent. But it is not superficial and you learn a lot of thing. I highly recommend this professor, but be prepared for this class!",
            "In his class right now.... One of the worst professors I've ever had in my entire education experience. He is a mean old man and puts you on the spot. Makes everyone in the back row move to the very front row. Assignments are like getting a bullet in the foot... You've just been shot & are bleeding but unfortunately, still alive. DO NOT TAKE HIM.",
            "Need to put 200% effort. At least 15-20 hrs in the weekend and 2-3 hours in the week.Very demanding and will keep challenging the entire semester. Be prepared in every class if you don't want to be embarrassed in the class.He helps immensely with the class matter but not the personal issues in dealing with the class. Buckle up for a roller coaster.",
            "If you want an easy A, this is definitely not your class. If you're looking for a challenge, take his class. I walked away with an A from his class. I am so honored to have had such a ridiculously successful man as a professor. His assignments are deadly. But if you're willing to do the work, it will definitely be worth your time."
        ]
    },
    {
        "id": 196,
        "first_name": "George",
        "last_name": "Davis",
        "similar_professors": [
            "Carla Nietfeld",
            "David Lindequist",
            ""
        ],
        "ratings": [
            "I really enjoyed having Davis! I will admit, sometimes the concepts in his lectures don't immediately click, but he is the most helpful if you go to office hours. I didn't understand how some concepts connected and he spent a hour with me visualizing and reviewing everything before the exam. His exams are not difficult-do the exam review materials.",
            "Worst teacher ever. Doesnt teach well at all",
            "This man, and understand I'm taking this class online during the pandemic so this might not be applicable if this lockdown gets resolved, but he is the singular worst teacher I've had in college. He simply is lazy and does not care one bit, he's recorded lectures are unacceptably horrid. Poor resolution and poorer audio quality. NEVER RESPONDS.",
            "This quizzes this man gives are more about semantics than economics. They would be easy except he has to make the wording as complicated as possible for simple questions. His lectures are fine, nothing extraordinary.",
            "Great prof, obviously very knowledgeable and wants to see students succeed. Teaches at a moderate-slow pace and will often review what you went over the week before. Ensures you're learning the \"why\" instead of just throwing equations at you. This material can be challenging but is IMPORTANT which is why it's helpful to have him as a professor.",
            "Horrible Class. Exam average under 70% for all exams. All notes are handwritten during class, and his handwriting is illegible most of the time. Good luck if you miss a class, better have a friend who was there. Overcomplicates everything and asks VERY abstract conceptual questions for exams/online quizzes. Also no practice for quanitative problems",
            "He's the chair of the department , and the person is so nice. His office hour is really really ... helpful, and he could explain very well when you ask him question. There are study questions before exams, and he allowed that use the final exam grade to replace one exam if you did not did well in first or second exam, and he gives review session.",
            "Dr. Davis is a really nice and knowledgeable professor. He explains difficult theories clearly and show the complicated models step-by-step. His office hour is also very helpful. Really enjoy this course.",
            "Mr. Davis is a really fair and enjoyable teacher. He is thankfully not the typical \"watch a slide-show full of notes and copy it down\" teacher. He gives real life examples and has a good personality about it. His tests are fair and if you spend a couple good nights studying you will be fine. Also he is a very easy grader. Enjoyed this class",
            "Took his class over winter term. Fast paced, and not necessarily easy, but I found that if you do the readings and practice exams everything becomes more clear. George is a genuine guy and willing to clarify if you need more help understanding something."
        ]
    },
    {
        "id": 197,
        "first_name": "Roberta",
        "last_name": "Schultz",
        "similar_professors": [
            "Gerardo Rincon",
            "Greg Gerfen",
            ""
        ],
        "ratings": [
            "This class was super easy, you don't need the book if you take good notes (which aren't a lot with the course pack). Attendance wasn't mandatory at the beginning but then she realized everyone was skipping so made in class assignments and you had to do 9/13 to get full points and wouldn't email the study guide. I put in minimal effort and got an A.",
            "She's a great prof. She asked us how she could improve the class halfway through the semester and changed everything up. She uses LearnSmart, so if you want to save money don't take her class. Otherwise, it's an interesting lecture class.",
            "I really enjoyed this class... the material was very interesting (perhaps to me bc it's my major), the assignments were reasonable, and the professor was very considerate/flexible. She had several class meetings and the final online, which allowed many of us to save much time/gas $ bc it was @ GR's beltline. Highly recommend taking during Summer!",
            "A really good learning environment, and a teacher who is up to date with the latest development in her field.",
            "enjoyed the taste test. went to office hours and got a lot of help. wish she taught more undergrad classes",
            "overall interesting examples. best professor I've had at WMU. Go to class and you'll do well on tests.",
            "EXTREMELY dull class. seriously boring. plus she had speaker trouble in the beginning which amplified her voice to painful levels. she has quizzes that border on pop, so you almost HAVE to attend the lectures... otherwise just buy the slide booklet and study the reviews she posts and you'll do fine.",
            "Class was boring as hell. she tried to show clips to keep it interesting but just read from the slides the rest of the time. Really annoying voice and constantly tried to appeal to the males in the class. Tests arent bad as long as you study the slides. 7 random quizzes, she takes the best 5",
            "Pretty standard lecture class. Less boring than most. Quite amusing prof.",
            "The class is easy, you dont need to go to class she just gives you all the slides to study so its not that hard. She is kinda goofy and her lectures can get pretty boring but I didnt mind taking this class."
        ]
    }
]